[
  {
    "latin": "Abaev",
    "cyrillic": "",
    "checked": "",
    "desc": "Abaev - last name comes from the Scythian word \"Abay\" which means \"water.\" Abaev can also mean \"quick\" or \"mighty\" and \"ev\" in Russian means \"son of\", which means \"son of water.\" It may mean that someone from this ancestral line was known to be quick or mighty as water. Abaev was originally \"Aboev.\" \"Abo\" means \"father\" and \"ev\" in Russian means \"son of,\" which means \"son of father.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Abayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Abayev - the last name comes from the Scythian word \"Abay\" which means \"water.\" Abayev can also mean \"quick\" or \"mighty\"  and \"ev\" in Russian means \"son of\", which means \"son of water.\" It may mean that someone from this ancestral line was known to be quick or mighty as water. Abayev was originally \"Aboev.\" \"Abo\" means \"father\" and \"ev\" in Russian means \"son of,\" which means \"son of a father.",
    "links": "https://books.google.com/books?id=ARyeneZne9gC&pg=PA43&lpg=PA43&dq=abayev+meaning&source=bl&ots=BIA1P7cRmA&sig=ACfU3U3SYFcHjVi46phQFS_Z7Fn8kFAZAw&hl=en&sa=X&ved=2ahUKEwiky7SZ5-HiAhWiiOAKHQf0DRE4ChDoATAGegQICBAB#v=onepage&q=abayev%20meaning&f=false",
    "more": ""
  },
  {
    "latin": "Abdiyev",
    "cyrillic": "",
    "checked": "",
    "desc": "Abdiyev - the last name comes from the Tajik word \"Abd\" which means \"slave or servant\" and \"iy\" makes it sound sweeter in Russian, which will be \"Rabslkiy or Slyzhiviy,\" and \"ev\" in Russian means \"son of,\" which means \"son of servant.\" It may mean that someone in this ancestral line was know to have servents in his household or was known to be a pious servant of God.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Abdukarimov",
    "cyrillic": "",
    "checked": "",
    "desc": "Abdurakhamov - the last name comes from the Tajik word \"Abd\" which means \"slave or servant,\"  \"rakham\" is a Hebrew word that means \"gracious\" and \"ov\" in Russian means \"son of,\" which means \"son of a servant of the gracious.\" It may mean that someone in this ancestral line was known to be a pious servant of God, who is gracious.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Abdurachamov",
    "cyrillic": "",
    "checked": "",
    "desc": "Abdurachamov - the last name comes from the Tajik word \"Abd\" which means \"slave or servant\" and \"rakham\" is a Hebrew word that means \"gracious\" and \"ov\" in Russian means \"son of,\" which means \"son of a servant of the gracious.\" It may mean that someone in this ancestral line was known to be a pious servant of God, who is gracious.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Abdurakhamov",
    "cyrillic": "",
    "checked": "",
    "desc": "Abdurachamov - the last name comes from the Tajik word \"Abd\" which means \"slave or servant,\"  \"rakham\" is a Hebrew word that means \"gracious\" and \"ov\" in Russian means \"son of,\" which means \"son of a servant of the gracious.\" It may mean that someone in this ancestral line  was known to be a pious servant of God, who is gracious.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Abjierov",
    "cyrillic": "",
    "checked": "",
    "desc": "Abjierov - the last name comes from the word “Abjier\" goes by the Hebrew name “Abjiah” which means “God is my father\" or \"My father is God\" and \"ov\" in Russian means \"son of,\" which means \"son of God.",
    "links": "https://en.wikipedia.org/wiki/Abijah",
    "more": ""
  },
  {
    "latin": "Abokhiyaev",
    "cyrillic": "",
    "checked": "",
    "desc": "Abokhiyaev - last name comes from an Arabic word \"abok\" which means \"father\" and \"hiya\" means \"heart\" and \"ev\" in Russian means \"son of,\" which means \"son of my father's heart.\" It may mean that someone in this ancestral line was known for closely honoring and loving his father.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Abokhiyayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Abokhiyayev - last name comes from an Arabic word \"abok\" which means \"father\" and \"hiya\" means \"heart\" and \"ev\" in Russian means \"son of,\" which means \"son of my father's heart.\" It may mean that someone in this ancestral line was known for closely honoring and loving his father.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Abromchaev",
    "cyrillic": "",
    "checked": "",
    "desc": "Abromchaev - last name comes from the name \"Abram\" and \"cha\" means \"short.\" The last name Abromchaev comes from a nickname that has two parts. The first part was that Abram got this nickname and \"chay\" which means short and \"ev\" in Russian means \"son of\".Abramchaev means \"Son of Abram who has a short height.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Abramoff",
    "cyrillic": "",
    "checked": "",
    "desc": "Abramoff - last name comes from the Hebrew name \"Abram\" and \"ov\" in Russian means \"son of\" which means \"son of Abram\", primarily used by the Bukharan Jews. Abramov was one of the old Russian surnames that originally came from the 16th century. Abramov was the most common surname in the territory of the Russian Empire. It was later adopted by Jews following the Paritions of Poland. The name \"Abram\" (Avram) came from a man named Avraham, who was the first patriarch of Jews in Israel. The meaning of the name Avraham/Abram is \"the father of a large number of nations.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Abramov",
    "cyrillic": "Абрамов",
    "checked": "",
    "desc": "Abramov - last name comes from the Hebrew name \"Abram\" and \"ov\" in Russian means \"son of\" which means \"son of Abram\", primarily used by the Bukharian Jews. Abramov was one of the old Russian surnames that originally came from the 16th century. Abramov was the most common surname in the territory of the Russian Empire. It was later adopted by Jews following the Paritions of Poland. The name \"Abram\" (Avram) came from a man named Avraham, who was the first patriarch of Jews in Israel. The meaning of the name Avraham/Abram is \"the father of a large number of nations.",
    "links": "https://en.wikipedia.org/wiki/Abramov",
    "more": "https://dbs.bh.org.il/familyname/abramov"
  },
  {
    "latin": "Abulkhayr",
    "cyrillic": "",
    "checked": "",
    "desc": "Abulkhayr - last name comes from an Arabic word \"abu\" which means \"father\" and \"khayr\" means \"of good.\" The full name means \"father of good,\" according to Hanna Tolmas.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Achildiyev",
    "cyrillic": "",
    "checked": "",
    "desc": "Achildiyev - Ochildiev - last name comes from the word \"ochildi\" which means \"blossom\" and \"ev\" in Russian means \"son of,\" It may mean that the son of someone from this ancestral line was known to be confident or attractive.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Achunov",
    "cyrillic": "",
    "checked": "",
    "desc": "Achunov - last name comes from an Uzbek word \"Akhun\" which means \"a strong and tall man\" and \"ev\" in Russian means \"son of.\" It may mean that a son of male family member or patriarch from this ancestral line was known to be strong and tall. [This was contributed by Gavriel Gavrielov.]",
    "links": "",
    "more": ""
  },
  {
    "latin": "Aharonov",
    "cyrillic": "",
    "checked": "",
    "desc": "Aharonov - last name comes from the Hebrew word “Aharon” which means “Aaron” and “ov” in Russian means “son of,” which means “son of Aaron.” Aharonov comes from the name Aaron (Aharon) who is the son of Amram and Jochebed from the tribe of Levi. Aaron was known to be the first high priest for the Jewish people, the ancestor of the Cohanim and the elder brother of Moses. Aaron was a fluent spokesman and the right-handed man of Moses, along with seven other men Aron, Aren, Oren, Horn, Goren, Oron and Baron. The name \"Aron\" and \"Aharon\" means \"mountain of strength.\" It may mean that someone from this ancestral line was known for their strength.",
    "links": "https://dbs.bh.org.il/familyname/aharonov",
    "more": ""
  },
  {
    "latin": "Akbashev",
    "cyrillic": "",
    "checked": "",
    "desc": "Akbashev - last name comes from the word \"akbash\" which means \"white hair\" and \"ev\" in Russian means \"son of,\" which means \"son of white hair.\" It may mean that someone from this ancestral line had very distinguishing white hair that began at a young age.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Akbashov",
    "cyrillic": "",
    "checked": "",
    "desc": "Akbashov - last name comes from the word \"akbash\" which means \"white hair\" and \"ov\" in Russian means \"son of,\" which means \"son of white hair.\" It may mean that someone from this ancestral line had very distinguishing white hair that began at a young age.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Akhunov",
    "cyrillic": "",
    "checked": "",
    "desc": "Akhunov - last name comes from an Uzbek word \"Akhun\" which means \"a strong and tall man\"and \"ov\" in Russian means \"son of,\" It may mean that a son of a male family member from this ancestral line was known to be strong and tall. This was contributed by Gavriel Gavrielov.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Akiloff",
    "cyrillic": "",
    "checked": "",
    "desc": "Akiloff - last name comes from a Farsi word \"Akil\" which means \"clear mind or wise\" and \"ov\" in Russian means \"son of,\" which means \"son of wise.\" It may mean that someone in your ancestral line was very intelligent and obtained the nickname \"Akil\" - wise. This name is primarily used by Bukharan Jews and Mountain (Kavkazi) Jews. Akilov can also mean gifted with a logical mind and wisdom.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Akilov",
    "cyrillic": "",
    "checked": "",
    "desc": "Akilov - last name comes from a Farsi word \"Akil\" which means \"clear mind or wise\" and \"ov\" in Russian means \"son of,\" which means \"son of wise.\" It may mean that someone in your ancestral line was very intelligent and obtained the nickname \"Akil\" - wise. This name is primarily used by Bukharan Jews and Mountain (Kavkazi) Jews. Akilov can also mean gifted with a logical mind and wisdom.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Akilow",
    "cyrillic": "",
    "checked": "",
    "desc": "Akilow - last name comes from a Farsi word \"Akil\" which means \"clear mind or wise\" and \"ov\" in Russian means \"son of,\" which means \"son of wise.\" It may mean that someone in your ancestral line was very intelligent and obtained the nickname \"Akil\" - wise. This name is primarily used by Bukharan Jews and Mountain (Kavkazi) Jews. Akilov can also mean gifted with a logical mind and wisdom.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Akperov",
    "cyrillic": "",
    "checked": "",
    "desc": "Akperov - last name comes from the word \"Akper\" which means \"clever\" and \"ov\" in Russian means \"son of,\" which means \"son of clever.\" It may mean that someone from this ancestral line was known to be clever.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Aksakalov",
    "cyrillic": "",
    "checked": "",
    "desc": "Aksakalov - last name comes from the word \"aksakal\" which means \"white beard\" and “ov\" in Russian means \"son of,\" which means \"son of white beard.” The name Aksakalov was given a nickname to elderly men who were known to have white beards.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Alaev",
    "cyrillic": "",
    "checked": "",
    "desc": "Alaev - last name comes from the Uzbek word \"Alay\" which means \"blue\" and \"ev\" in Russian means \"son of,\" which means \"son of blue.\" It may mean that the family from this ancestral line were known to have blue eyes. This was contributed by Gavriel Gavrielov.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Alaiev",
    "cyrillic": "",
    "checked": "",
    "desc": "Alaiev - last name comes from Uzbek word \"Alay\" which means \"blue\" and \"ev\" in Russian means \"son of,\" which means \"son of blue.\" It may mean that the family from this ancestral line were known to have blue eyes. This was contributed by Gavriel Gavrielov.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Alayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Alayev - last name comes from Uzbek word \"Alay\" which means \"blue\" and \"ev\" in Russian means \"son of,\" which means \"son of blue.\" It may mean that the family from this ancestral line were known to have blue eyes. This was contributed by Gavriel Gavrielov.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Alishayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Alishayev - last name comes from the Hebrew name \"Elisha\" which means \"my God is my salvation.\" Elisha was a prophet and a miracle worker. He was the attendant of Elijah and succeeded him after his ascension to heaven.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Allayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Allayev - last name comes from Uzbek word \"Alay\" which means \"blue\" and \"ev\" in Russian means \"son of,\" which means \"son of blue.\" It may mean that the family from this ancestral line were known to have blue eyes. This was contributed by Gavriel Gavrielov.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Aminov",
    "cyrillic": "",
    "checked": "",
    "desc": "Aminov - There are several information that exist with the name Aminov. According to Hanna Tolmas, the word \"amin\" comes from the Arabic word \"calm and confident.\" The second meaning of the last name comes from the \"chala\" Jews who were using the name, or were given the name Aminov, from \"Amin\" which is a title of a Muslim Cleric. It was a way in which the Jewish community would be recognized itself by those who either converted or took the role of Islam. Aminov also from Binyamin. Binyamin was son of Kandini and Mullo (Mullokandov) and his full name was Binyamin Amini Mullokand. His children were Aminov (the Eshon ones are Cohanim and not the Kashuk). This was contributed by Gavriel Gavrielov.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Amuev",
    "cyrillic": "",
    "checked": "",
    "desc": "Amuev - last name comes from the word “amu” which means “business or finance” and \"ev\" in Russian means \"son of\". It may mean that the son of someone from this ancestral line was known to be a bookkeeper that kept records of financial affairs of businesses for Emir of Bukhara.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Amuyev",
    "cyrillic": "",
    "checked": "",
    "desc": "Amuyev - last name comes from the word “amu” which means “business or finance\" and \"ev\" in Russian means \"son of\". It may mean that the son of someone from this ancestral line was known to be a bookkeeper that kept records of financial affairs of businesses for Emir of Bukhara.",
    "links": "https://www.kabalarians.com/m/amu.htm",
    "more": ""
  },
  {
    "latin": "Araboff",
    "cyrillic": "",
    "checked": "",
    "desc": "Araboff - last name comes from the word \"Arab\" which means \"deserts and barren lands without water and vegetation\" and \"ov\" in Russian means \"son of.\" Araboff means \"son of who came from deserts and barren lands without water and vegetation.\" It may be that your ancestors came to Central Asia from an Arab lands and the community gave them nickname \"Arab,\" which was passed down to the children who become Arabov. Also, your ancestors' skin may have been darker then the Bukharian Jews in Central Asia and therefore got their nickname \"Arab\". This name is primarily used by the Bukharian Jews.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Arabov",
    "cyrillic": "",
    "checked": "",
    "desc": "Arabov - last name comes from the word \"Arab\" which means \"deserts and barren lands without water and vegetation\" and \"ov\" in Russian means \"son of.\" Arabov means \"son of who came from deserts and barren lands without water and vegetation.\" It may be that your ancestors came to Central Asia from an Arab lands and the community gave them nickname \"Arab,\" which was passed down to the children who become Arabov. Also, your ancestors' skin may have been darker then the Bukharian Jews in Central Asia and therefore got their nickname \"Arab\". This name is primarily used by the Bukharian Jews.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Arabow",
    "cyrillic": "",
    "checked": "",
    "desc": "Arabow - last name comes from the word \"Arab\" which means \"deserts and barren lands without water and vegetation\" and \"ov\" in Russian means \"son of.\" Arabow means \"son of who came from deserts and barren lands without water and vegetation.\" It may be that your ancestors came to Central Asia from an Arab lands and the community gave them nickname \"Arab,\" which was passed down to the children who become Arabov. Also, your ancestors' skin may have been darker then the Bukharian Jews in Central Asia and therefore got their nickname \"Arab\". This name is primarily used by the Bukharian Jews.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Arakmastov",
    "cyrillic": "",
    "checked": "",
    "desc": "Arakmastov - last name comes from the word \"arakmast\" which means \"drinking vodka\" and \"ov\" in Russian means \"son of,\" which means \"son of drinking vodka.\" It may mean that someone or a group of family members from this ancestral line were known to drink vodka occasionally or were in the busness of selling alochol.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Aranbaev",
    "cyrillic": "",
    "checked": "",
    "desc": "Aranbaev - last name comes from the Hebrew name “Aron,” which means “son of Aharon.” Aronbayev has a similar from both Aharonov and Aronov. The word “bay” means “rich” and \"ev\" in Russian means \"son of\". It may mean that the son of someone from this ancestral line was known to be rich or came from a rich family.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Aranbayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Aranbayev - last name comes from the Hebrew name “Aron,” which means “son of Aharon.” Aronbayev has a similar from both Aharonov and Aronov. The word “bay” means “rich\" and \"ev\" in Russian means \"son of\". It may mean that the son of someone from this ancestral line was known to be rich or came from a rich family.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Arbabov",
    "cyrillic": "",
    "checked": "",
    "desc": "Arbabov - last name comes from the Persian word \"arbab\" which means \"master and landlord\" and \"ov\" in Russian means \"son of,\" which means \"son of master.\" It may mean that someone from this ancestral line was a master or landlord who owned a property such as a land.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Ariyev",
    "cyrillic": "",
    "checked": "",
    "desc": "Ariyev - last name comes from the Hebrew name \"Ari\" which means \"lion and \"ev\" in Russian means \"son of.\" It may mean that the son of someone from this ancestral line was known to be strong or brave like a lion. The word \"lion\" can also represent \"leadership.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Aronbayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Aronbayev - last name comes from the Hebrew name “Aron,” which means “son of Aharon.” Aronbayev has a similar from both Aharonov and Aronov. The word “bay” means “rich” and \"ev\" in Russian means \"son of.\" It may mean that the son of someone from this ancestral line was known to be rich or came from a rich family.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Aronov",
    "cyrillic": "",
    "checked": "",
    "desc": "Aronov - last name comes from the Hebrew name \"Aron.\" Aronov has the same meaning as Aharonov. Aharon who is the son of Amram and Jochebed from the tribe of Levi. Aharon was known to be the first high priest for the Jewish people, the ancestor of the Cohanim and the elder brother of Moses. Aaron was a fluent spokesman and the right-handed man of Moses, along with seven other men Aron, Aren, Oren, Horn, Goren, Oron and Baron. The name \"Aron\" and \"Aharon\" means \"mountain of strength\" and \"ov\" in Russian means \"son of.\" It may mean that the son of someone from this ancestral line was known for their strength.",
    "links": "https://dbs.bh.org.il/familyname/aronov",
    "more": ""
  },
  {
    "latin": "Asheroff",
    "cyrillic": "",
    "checked": "",
    "desc": "Asheroff - last name comes from the Hebrew name “Asher” which means “happy or blessed” and “ov” in Russian means “son of,” which means “son of happy.” Asherov comes from the name Asher who is the son of Jacob and Leah’s handmaid Zilpah. The original roots from the name Asher comes from some parts of Germany, Bohemia and Eastern Europe.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Asherov",
    "cyrillic": "",
    "checked": "",
    "desc": "Asherov - last name comes from the Hebrew name “Asher” which means “happy or blessed” and “ov” in Russian means “son of,” which means “son of happy.” Asherov comes from the name Asher who is the son of Jacob and Leah’s handmaid Zilpah. The original roots from the name Asher comes from some parts of Germany, Bohemia and Eastern Europe.",
    "links": "https://dbs.bh.org.il/familyname/asherof",
    "more": ""
  },
  {
    "latin": "Ashirov",
    "cyrillic": "",
    "checked": "",
    "desc": "Ashirov - last name comes from the Hebrew name “Asher” which means “happy or blessed” and “ov” in Russian means “son of,” which means “son of happy.” Asherov comes from the name Asher who is the son of Jacob and Leah’s handmaid Zilpah. The original roots from the name Asher comes from some parts of Germany, Bohemia and Eastern Europe.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Auloff",
    "cyrillic": "",
    "checked": "",
    "desc": "Auloff - last name comes from an Uzbek word \"Aul\" which means \"village\" and \"ov\" in Russian means \"son of\". Aulov means \"son of people who came from a village.\" It may be that the family from this ancestral line lived many years in small village in Central Asia and then when they moved to a big city, the community gave the family a nickname \"Aul,\" which means a family from a small village. This name primarily used by the Bukharan Jews. Auloff could also refer as tents being set up in fields to create camps. This was contributed by Gavriel Gavirelov.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Aulov",
    "cyrillic": "",
    "checked": "",
    "desc": "Aulov - last name comes from an Uzbek word \"Aul\" which means \"village\" and \"ov\" in Russian means \"son of\". Aulov means \"son of people who came from a village.\" It may be that the family from this ancestral line lived many years in small village in Central Asia and then when they moved to a big city, the community gave the family a nickname \"Aul,\" which means a family from a small village. This name primarily used by the Bukharan Jews. Aulov could also refer as tents being set up in fields to create camps. This was contributed by Gavriel Gavirelov.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Aulow",
    "cyrillic": "",
    "checked": "",
    "desc": "Aulow - last name comes from an Uzbek word \"Aul\" which means \"village\" and \"ov\" in Russian means \"son of\". Aulov means \"son of people who came from a village.\" It may be that the family from this ancestral line lived many years in small village in Central Asia and then when they moved to a big city, the community gave the family a nickname \"Aul,\" which means a family from a small village. This name primarily used by the Bukharan Jews. Aulow could also refer as tents being set up in fields to create camps. This was contributed by Gavriel Gavirelov.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Avezboke",
    "cyrillic": "",
    "checked": "",
    "desc": "Avezboke - \"Avez\" comes from an Arabic word that translates \"in exchange or merchant\" instead of \"conpensation.\" The name \"avez\" usually was given in the Bukharian Jewish community to a boy that was born right after the death of the previous child. The word \"boke\" in Arabic means \"the remainer or eternal.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Avezbadalov",
    "cyrillic": "",
    "checked": "",
    "desc": "Avezbadalov - last name comes from an Uzbek word “Avezbadal” which means “exchange or merchant” and “ov” in Russian means “son of,” which means “son of exchange.” It may mean that someone from this ancestral line was well known to be a merchant who trade or sell a lot of merchandises. This was contributed by Gavriel Gavrielov. According to Hanna Tolmas, the word \"Avez\" comes from the Arabic word that translates \"in exchange\" or \"instead of\" \"conpensation\" - the name \"avez\" usually was given in the Bukharian Jewish community to a boy that was born right after the death of the previous child. Later on the name became a last name when the \"ov\" was add it.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Avezbakiyev",
    "cyrillic": "",
    "checked": "",
    "desc": "Avezov - There are few informatin exist about this last name. According to Hanna Tolmas, the word \"Avez\" comes from the Arabic word that translates \"in exchange\" \"instead of\" \"conpensation\" - the name \"avez\" usually was given in the Bukharian Jewish community to a boy that was born right after the death of the previous child. Later on the name became a last name when the \"ov\" was add it. According to Gavriel Gavrilov, the last name comes from the word \"avez\" which means \"voice\" and \"ev\" in Russian means \"son of,\" which means \"son of voice.\" It may mean that someone from this ancestral line had a unique voice or was a singer or a Chazzan (someone who reads from a Torah scroll in the Synagogue). Avezov also refers as a meaning to greatness or higher position in Uzbekistan.",
    "links": "https://translate.google.com/#view=home&op=translate&sl=ky&tl=en&text=%D1%8D%D0%BB%D1%87%D0%B8%D0%BB%D0%B8%D0%BA",
    "more": ""
  },
  {
    "latin": "Avezov",
    "cyrillic": "",
    "checked": "",
    "desc": "Avezov - There are few informatin exist about this last name. According to Hanna Tolmas - \"Avez\" comes from an Arabic word that translates \"in exchange\" \"instead of\" \"conpensation\" - the name avez usually was given in the Bukharian Jewish community to a boy that was born right after the death of the previous child. Later on the name became a last name when \"ov\" was add it. According to Gavriel Gavrilov the last name comes from the word \"avez\" which means \"voice\" and \"ov\" in Russian means \"son of,\" which means \"son of voice.\" It may mean that someone from this ancestral line had a unique voice or was a singer or a Chazzan (someone who reads from a Torah scroll in the Synagogue). Avezov also refers as a meaning to greatness or higher position in Uzbekistan.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Avizov",
    "cyrillic": "",
    "checked": "",
    "desc": "Avizov - last name comes from an Uzbek word \"aviz\" which means \"chandelier\" and \"ov\" in Russian means \"son of.\" It may mean that the son of someone from this ancestral line was known to worked or owned a chandelier store or made chandeliers.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Ayasov",
    "cyrillic": "",
    "checked": "",
    "desc": "Ayasov - last name comes from the word \"Ayas\" which means \"cool morning breeze\" and \"ov\" in Russian means \"son of,\" which means \"son of cool morning breeze.\" This was contributed by Gavriel Gavrielov.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Aylarov",
    "cyrillic": "",
    "checked": "",
    "desc": "Aylarov - last name comes from an Uzbek word \"Aylar\" which means \"dancing or dancers\" and \"ov\" in Russian means \"son of,\" which means \"son of dancing.\" It may mean that the family from this ancestral line were well known dancers. This was contributed by Gavriel Gavrielov.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Ayllarov",
    "cyrillic": "",
    "checked": "",
    "desc": "Ayllarov - last name comes from an Uzbek word \"Ayllar\" which means \"dancing or dancers\" and \"ov\" in Russian means \"son of,\" which means \"son of dancing.\" It may mean that the family from this ancestral line were well known dancers. This was contributed by Gavriel Gavrielov.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Bababekov",
    "cyrillic": "",
    "checked": "",
    "desc": "Bababekov - last name comes from the word \"baba\" means \"grandfather or father\" and \"bek\" in Uzbek means \"ruler.\" The full name means \"eldest of the ruler.\" The last name Bababekov was known to be from many generations a family that were rich and wealthy.",
    "links": "https://translate.google.com/#view=home&op=translate&sl=uz&tl=en&text=bababek",
    "more": ""
  },
  {
    "latin": "Babadzhanov",
    "cyrillic": "",
    "checked": "",
    "desc": "Babadzhanov - last name comes from the word ",
    "links": "",
    "more": ""
  },
  {
    "latin": "Babaev",
    "cyrillic": "",
    "checked": "",
    "desc": "Babaev - last name comes from the word \"baba\" which means \"grandfather or old man\" and \"ev\" in Russian means \"son of.\" It may mean that the son of someones grandfather from this ancestral line was kind and friendly to others.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Babaisakov",
    "cyrillic": "",
    "checked": "",
    "desc": "Babaisakov - last comes from the word \"baba\" which means \"grandfather or old man\" and the word \"isak\" means \"laugh.\" It may mean that a grandfather from this ancestral line was known to be funny and tell jokes to others.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Babakhanov",
    "cyrillic": "",
    "checked": "",
    "desc": "Babakhanov - last name comes from the word \"baba\" which means \"grandfather or old man\" and \"khan\" means \"ruler.\" It may mean that a grandfather from this ancestral line was a leader of his family or a community.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Babayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Babayev - last name comes from the word \"baba\" which means \"grandfather or old man.\" It may mean a grandfather from this ancestral line was kind and friendly to others.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Babekov",
    "cyrillic": "",
    "checked": "",
    "desc": "Babekov - last name was originally Bababekov. About 200 years ago, a male family member from this ancestral line had decided to cut the surname and made it shorter by removing the \"Ba\" and making into the name Babekov. Babekov has the same meaning as Bababekov, which means \"grandfather or father\" and \"bek\" in Uzbek means \"ruler.\" The full name means \"eldest of the ruler.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Babishov",
    "cyrillic": "",
    "checked": "",
    "desc": "Babishov - last name comes from an Uzbek word \"babish\" which means \"a baby\" and \"ov\" in Russian \"son of,\" which means \"son of a baby.\" It may mean that someone from this ancestral line was known to act like a baby or has a babyface.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Bachaev",
    "cyrillic": "",
    "checked": "",
    "desc": "Bachaev - last name comes from the word \"bacha\" which means \"a child.\" It may mean that someone from this ancestral line was known to be acting like a child.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Bachayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Bachayev - last name comes from the word \"bacha\" which means \"a child.\" It may mean that someone from this ancestral line was known to be acting like a child.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Badalbayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Badalbayev - last name comes from the word \"badal\" which means \"exchange\" and \"bay\" means \"rich.\" It may mean that someone from this ancestral line became rich from working at an exchange.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Badalov",
    "cyrillic": "",
    "checked": "",
    "desc": "Badalov - last name comes from the word \"badal\" which means \"exchange\" and \"ov\" in Russian means \"son of,\" which means \"son of exchange.\" It may mean that someone this ancestral line had worked at an exchange.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Balkhiyev",
    "cyrillic": "",
    "checked": "",
    "desc": "Balkhiyev - last name comes from the word \"Balkh\" is a name of a town near the capital Mazar-i-Sherif in Afghanistan. It may mean that a family from this ancestral line had once lived in a town of Balkh in Afghanistan.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Bangieff",
    "cyrillic": "",
    "checked": "",
    "desc": "Bangieff - last name comes from the word \"Bangi\" which means \"narcotics\" and \"ov\" in Russian means \"son of,\" which means \"son of narcotics\". It may mean that someone from this ancestral line was in the pharmaceutical industry and supplied people with painkillers. This name primarily used by the Bukharan Jews.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Bangiev",
    "cyrillic": "",
    "checked": "",
    "desc": "Bangiev - last name comes from the word \"Bangi\" which means \"narcotics\" and \"ov\" in Russian means \"son of,\" which means \"son of narcotics\". It may mean that someone from this ancestral line was in the pharmaceutical industry and supplied people with painkillers. This name primarily used by the Bukharan Jews.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Bangiew",
    "cyrillic": "",
    "checked": "",
    "desc": "Bangiew - last name comes from the word \"Bangi\" which means \"narcotics\" and \"ov\" in Russian means \"son of,\" which means \"son of narcotics\". It may mean that someone from this ancestral line was in the pharmaceutical industry and supplied people with painkillers. This name primarily used by the Bukharan Jews.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Baraev",
    "cyrillic": "",
    "checked": "",
    "desc": "Baraev - last name comes from the word \"Bara\" which means \"a lamb\" and \"ev\" in Russian means \"son of,\" which means \"son of a lamb.\" It may mean that someone from this ancestral line was either a farmer or a sheepherder who had a lamb or this nickname was given to someone like a child.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Barakayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Barakayev - last name comes from an Uzbek word \"baraka\" which means \"blessings.\" It may mean that someone from this ancestral line were known to give blessings to people.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Barakov",
    "cyrillic": "",
    "checked": "",
    "desc": "Barakov - last name comes from the Hebrew word \"Barak\" which means \"lightning\" and \"ov\" in Russian means \"son of,\" which means \"son of lightning\". This name is primarily used by Bukharian Jews. The word \"Barak\" can also mean a pastry that was made by a boiled dough and glazed with sweets, such as honey. It may mean that someone from this ancestral line was known to be a baker who made popular sweet pastries and worked as fast as lightning. This was contributed by Gavriel Gavrielov.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Barayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Barayev - last name comes from the word \"Bara\" which means \"a lamb\" and \"ev\" in Russian means \"son of,\" which means \"son of a lamb.\" It may mean that someone from this ancestral line was either a farmer or a sheepherder who had a lamb or this nickname was given to someone like a child.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Barukhov",
    "cyrillic": "",
    "checked": "",
    "desc": "Barukhov - last name comes from a Hebrew name \"Barukh\" and \"ov\" in Russian means \"son of,” which means \"son of blessed.” It may mean that someone from this ancestral line gave blessings to people. This name is primarily used by Bukharian Jews.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Baturov",
    "cyrillic": "",
    "checked": "",
    "desc": "Baturov - last name comes from the word \"Batur\" which means \"greatness or strength\" and \"ov\" in Russian means \"son of,\" which means \"son of strength.\" It may mean that someone from this ancestral line was known for their great strength. This was contributed by Gavriel Gavrielov.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Baybabayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Baybabayev - last name comes from the word \"bay\" means \"well-to-do\" and the word \"baba\" means \"grandfather.\" It may mean that a grandfather from this ancestral line was weathy or successful.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Baybachaev",
    "cyrillic": "",
    "checked": "",
    "desc": "Baybachaev - last name comes from the word \"bay\" means \"rich\" and the word \"bacha\" means \"child.\" It may mean that a child from this ancestral line came from a rich family.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Begimov",
    "cyrillic": "",
    "checked": "",
    "desc": "Begimov - last name comes from the word \"begim\" which means that it was a form given to a woman with high status.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Benyaminov",
    "cyrillic": "",
    "checked": "",
    "desc": "Benyaminov - last name comes from the Hebrew name \"Benyamin\" and \"ov\" in Russian means \"son of,\" which means \"son of Benyamin.\" Benyamin is a Biblical name, he was the youngest of the twelve tribes and the son of the Jewish patriarch Yaakov. Benyamin in Hebrew means \"son of the right hand.\" It may mean that someone from the ancestral was known to be a right hand man.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Benyayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Benyayev - last name comes from the word \"Benyay\" is the Hebrew name of \"Benaya\" which means \"God builds or God has built.\" It may mean that someone from this ancestral line was known to be a skilled builder.",
    "links": "http://www.meaning-of-names.com/hebrew-names/benaya.asp",
    "more": ""
  },
  {
    "latin": "Bibichaev",
    "cyrillic": "",
    "checked": "",
    "desc": "Bibichaev - last name comes from the word \"bibicha\" which means \"grandmother.\" It may mean that a grandmother from this ancestral line was known to be sweet and friendly to others.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Bibichayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Bibichayev - last name comes from the word \"bibicha\" which means \"grandmother.\" It may mean that a grandmother from this ancestral line was known to be sweet and friendly to others.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Binaminov",
    "cyrillic": "",
    "checked": "",
    "desc": "Binaminov - last name comes from the Hebrew name \"Benyamin\" and \"ov\" in Russian means \"son of,\" which means \"son of Benyamin.\" Benyamin is a Biblical name, he was the youngest of the twelve tribes and the son of the Jewish patriarch Yaakov. Benyamin in Hebrew means \"son of the right hand.\" It may mean that someone from the ancestral was known to be a right hand man.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Binyaminov",
    "cyrillic": "",
    "checked": "",
    "desc": "Binyaminov - last name comes from the Hebrew name \"Benyamin\" and \"ov\" in Russian means \"son of,\" which means \"son of Benyamin.\" Benyamin is a Biblical name, he was the youngest of the twelve tribes and the son of the Jewish patriarch Yaakov. Benyamin in Hebrew means \"son of the right hand.\" It may mean that someone from the ancestral was known to be a right hand man.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Bobodustov",
    "cyrillic": "",
    "checked": "",
    "desc": "Bobodustov - last name comes from the word \"Bobo\" which means \"Grandfather\" and the word \"Dustov\" which means \"friendly.\" It may mean that someone from this ancestral line, specifically a grandfather, was known to be friendly and loyal to others. This name is primarily used by Bukharian Jews.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Borokhov",
    "cyrillic": "",
    "checked": "",
    "desc": "Borokhov - last name comes from the Hebrew word \"borokh\" which means \"blessed\" and \"ov\" in Russian means \"son of,\" which means \"son of blessed.\" It may mean that someone from this ancestral line gave blessings to people.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Boruhov",
    "cyrillic": "",
    "checked": "",
    "desc": "Boruhov - last name comes from a Hebrew name \"Boruh\" and \"ov\" in Russian means \"son of,” which means \"son of blessed.” It may mean that someone from this ancestral line gave blessings to people. This name is primarily used by Bukharian Jews.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Boruhow",
    "cyrillic": "",
    "checked": "",
    "desc": "Boruhow - last name comes from a Hebrew name \"Boruh\" and \"ov\" in Russian means \"son of,” which means \"son of blessed.” It may mean that someone from this ancestral line gave blessings to people. This name is primarily used by Bukharian Jews.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Borukhov",
    "cyrillic": "Борухов",
    "checked": "",
    "desc": "Borukhov - last name comes from a Hebrew name \"Borukh\" and \"ov\" in Russian means \"son of,” which means \"son of blessed.” It may mean that someone from this ancestral line gave blessings to people. This name is primarily used by Bukharian Jews.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Buriyev",
    "cyrillic": "",
    "checked": "",
    "desc": "Buriyev - last name comes from an Uzbek name \"buri\" which means \"wolf.\" Bukharian Jews believed that if they give a name of an animal to a child, it will give them strength, live longer and to have endurance such as wolf. The reason for this was to prevent children from dying at a young age. It may mean that people from this ancestral line was given to nickname \"buri\" who had long lasting endurance. This name is primarily used by Bukharian Jews.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Chaimov",
    "cyrillic": "",
    "checked": "",
    "desc": "Chaimov - last name comes from a Hebrew name \"Chaim\" and \"ov\" in Russian means \"son of\" which means \"son of Chaim.\" This was primarily used by the Bukharan Jews and Mountain (Kavkazi) Jews. Also, the root \"Hai\" from Hebrew means \"Life\" and is the numerical value of \"18.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Chaimow",
    "cyrillic": "",
    "checked": "",
    "desc": "Chaimow - last name comes from a Hebrew name \"Chaim.\" This was primarily used by the Bukharian Jews and Mountain (Kavkazi) Jews. Also, the root \"Hai\" from Hebrew means \"Life\" and is the numerical value of \"18.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Chakchakov",
    "cyrillic": "",
    "checked": "",
    "desc": "Chakchakov- last name comes from the word \"ChakChak\" which means \"storyteller\" and \"ov\" in Russian means \"son of\" which means \"son of a storyteller.\" It may be that someone from this ancestral line was known to be a chatterbox or a storyteller. This name is primarily used by Bukharian Jews. Chakchakov can also mean a powerful, fluent speaker. This was contributed by Gavriel Gavrielov.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Chovosov",
    "cyrillic": "",
    "checked": "",
    "desc": "Chovosov - last name comes from the word \"chovos\" which means \"a grinding mill used to wheat into flour\" and \"ov\" in Russian means \"son of.\" It may mean that the son of someone or a group of family members were known for being farmers and using a grinding mill to make wheat into flour. This was contributed by Gavriel Gavrielov.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Chulpayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Chulpayev - last name comes from the word \"Chulpa\" which means \"shepherd\" and \"ev\" in Russian means \"son of,\" which means \"son of a shephard.\" It may mean that someone from this ancestral line was a shepherd or owned a lot of cattle. Chylpaev also has several meaning as \"chulpa or shurpa\" in dialect, in Tajik means \"soup of broth.\" But, in conversational Tajik also means \"fish\" or has a name for \"a type of fish.\" This name is primarily used by Bukharian Jews.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Chylpaev",
    "cyrillic": "",
    "checked": "",
    "desc": "Chylpaev - last name comes from the word \"Chylpa\" which means \"shepherd\" and \"ev\" in Russian means \"son of,\" which means \"son of a shephard.\" It may mean that someone from this ancestral line was a shepherd or owned a lot of cattle. Chylpaev also has several meaning as \"chulpa or shurpa\" in dialect, in Tajik means \"soup of broth.\" But, in conversational Tajik also means \"fish\" or has a name for \"a type of fish.\" This name is primarily used by Bukharian Jews.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Cohenov",
    "cyrillic": "Коинов, Коэнов",
    "checked": "",
    "desc": "Cohenov - last name comes from the Hebrew title \"Cohen\" and \"ov\" in Russian means \"son of,\" which means \"son of a Cohen.\" Cohanim (priests) are from one of the 12 tribes of Israel - \"Tribe Levi\". Many people with this last name have a lineage tracing back toward the priestly tribe of Levi and Aron the Cohen Gadol (high priest), brother of Moses. This name is primarily used by Bukharian Jews.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Dabakarov",
    "cyrillic": "",
    "checked": "",
    "desc": "Dabakarov - last name comes from the word \"dabakar\" which means \"strong or heavy worker\" and \"ov\" in Russian means \"son of,\" which means \"son of a strong worker.\" It may mean that someone from this ancestral line was known to be a strong worker. This name is primarily used by Bukharian Jews. This was contributed by Gavriel Gavrielov.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Daniarov",
    "cyrillic": "",
    "checked": "",
    "desc": "Daniarov - last name comes from the word \"Daniar\" and \"ov\" in Russian means \"son of,\" which means \"son of Daniar.\" The name \"Daniar\" is a Muslim version of \"Daniel.\" The name Daniel means in Hebrew \"God is my judge.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Danielov",
    "cyrillic": "",
    "checked": "",
    "desc": "Danielov - last name comes from the Hebrew name “Daniel” which means “God is my judge.” Danielov used to be Danielashvili. Many people with the family name Danielashvili changed their names to Danielov when they moved to Israel.",
    "links": "https://dbs.bh.org.il/familyname/danielashvili",
    "more": ""
  },
  {
    "latin": "Danyarov",
    "cyrillic": "",
    "checked": "",
    "desc": "Danyarov - last name comes from the word \"Danyar\" and \"ov\" in Russian means \"son of,\" which means \"son of Danyar.\" The name \"Danyar\" is a Muslim version of \"Daniel.\" The name Daniel means in Hebrew \"God is my judge.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Davidoff",
    "cyrillic": "",
    "checked": "",
    "desc": "Davidoff - last name comes from the Hebrew name “David” which means “beloved.\" Davidoff comes from the name David who was the youngest son of Jesse the Ephratite of Bethlehem, of the house of Judah, the  descendant of Boaz and Ruth the Moabitess. David was the first king of united Israel and Judah. David has been on the throne for more than 40 years from 1010 to 970 BCE.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Davidov",
    "cyrillic": "",
    "checked": "",
    "desc": "Davidov - last name comes from the Hebrew name “David” which means “beloved” and “ov” in Russian means “son of,” which means “son of beloved.” Davidov comes from the name David who was the youngest son of Jesse the Ephratite of Bethlehem, of the house of Judah, the  descendant of Boaz and Ruth the Moabitess. David was the first king of united Israel and Judah. David has been on the throne for more than 40 years from 1010 to 970 BCE.",
    "links": "https://dbs.bh.org.il/familyname/davidov",
    "more": ""
  },
  {
    "latin": "Davrayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Davrayev - last name comes from the word \"davra\" means gathering. Male ancestors from this ancestral line were known for having a gathering with only men where they sat together to eat meals or sang songs.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Davydov",
    "cyrillic": "",
    "checked": "",
    "desc": "Davydov - last name comes from the Hebrew name “David” which means “beloved” and “ov” in Russian means “son of,” which means “son of beloved.” Davydov comes from the name David who was the youngest son of Jesse the Ephratite of Bethlehem, of the house of Judah, the  descendant of Boaz and Ruth the Moabitess. David was the first king of united Israel and Judah. David has been on the throne for more than 40 years from 1010 to 970 BCE.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Dayanaev",
    "cyrillic": "",
    "checked": "",
    "desc": "Dayanaev - last name comes from the Hebrew word \"dayan\" which means \"a judge\"and \"ev\" in Russian means \"son of.\" It may mean that the son of someone from this ancestral line was well known to be a judge.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Dayanayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Dayanayev - last name comes from the Hebrew word \"dayan\" which means \"a judge\" and \"ev\" in Russian means \"son of.\" It may mean that the son of someone from this ancestral line was well known to be a judge.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Dehkanov",
    "cyrillic": "",
    "checked": "",
    "desc": "Dehkanov - last name comes from an Uzbek word \"dehkan\" which means \"peasant\" and \"ov\" in Russian means \"son of,\" which means \"son of peasant.\" It may mean that someone from this ancestral line might have been poor or came from a poor family.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Domatov",
    "cyrillic": "",
    "checked": "",
    "desc": "Domatov - last name comes from the word \"domat\" which means \"in law from the husband side of the family.\" A family will acquire this last name because their ancestors had the word \"domat\" as a nickname.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Dustov",
    "cyrillic": "",
    "checked": "",
    "desc": "Dustov - last name comes from the word \"dust\" which means \"friend\"and \"ov\" in Russian means \"son of.\" It may mean that the son of someone from this ancestral line was known to be a very friendly person with a big heart. This name is primarily used by Bukharian Jews.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Dyzdov",
    "cyrillic": "",
    "checked": "",
    "desc": "Dyzdov - this last name comes from the word \"dyz\" which means \"burglar/thief\" and \"ov\" in Russian means \"son of.\" It may mean that the son of someone from this ancestral line might have been a burglar or a thief. This name is primarily used by Bukharian Jews.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Dzhurayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Dzhurayev - last name comes from the word \"dzhuray\" which means \"friend\" and \"ev\" means son of.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Eliav",
    "cyrillic": "",
    "checked": "",
    "desc": "Eliav - last name comes from the Hebrew name \"Elia\" which means \"My god is the lord.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Elikboshov",
    "cyrillic": "",
    "checked": "",
    "desc": "Elikboshov - last name comes from the name \"Elikboshi\" was a nickname and or title of the individual who was in charge of the 50 regions in the Jewish quarter before the Russian Revolution. The person well known with this name was Sholomoi Hai Elikboshi.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Elnatanov",
    "cyrillic": "",
    "checked": "",
    "desc": "Elnatanov - last comes from the hebrew word \"elnoton\" wich means \"given by god\" ov means son of.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Elishaev",
    "cyrillic": "",
    "checked": "",
    "desc": "Elishaev - last name comes from the Hebrew name \"Elisha\" which means \"my God is my salvation.\" Elisha was a prophet and a miracle worker. He was the attendant of Elijah and succeeded him after his ascension to heaven.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Elishayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Elishayev - last name comes from the Hebrew name \"Elisha\" which means \"my God is my salvation.\" Elisha was a prophet and a miracle worker. He was the attendant of Elijah and succeeded him after his ascension to heaven.",
    "links": "https://www.behindthename.com/name/elisha",
    "more": ""
  },
  {
    "latin": "Elizarov",
    "cyrillic": "",
    "checked": "",
    "desc": "Elizarov - last name comes from the Hebrew name \"Eliezer\" which means \"help of my G-d.\" Eliezer was the second son of Moses and Zipporah.\"ov\" in Russian means \"son of,\" which means \"son of Eliezer\". Originaly it was a name Eliezer  that later becomes a lastname Yelizarov.",
    "links": "https://en.wikipedia.org/wiki/Eliezer",
    "more": ""
  },
  {
    "latin": "Ergashev",
    "cyrillic": "",
    "checked": "",
    "desc": "Ergashev - last name comes from the word ",
    "links": "",
    "more": ""
  },
  {
    "latin": "Faiziev",
    "cyrillic": "",
    "checked": "",
    "desc": "Faiziev - last name comes from an Uzbek word \"faizi\" which means \"percent\"?",
    "links": "",
    "more": ""
  },
  {
    "latin": "Farajev",
    "cyrillic": "",
    "checked": "",
    "desc": "Farajev - last name comes from an Uzbek word \"faraj\" which means \"screaming\"?",
    "links": "",
    "more": ""
  },
  {
    "latin": "Fatakhov",
    "cyrillic": "",
    "checked": "",
    "desc": "Fatakhov - last name comes from an Arabic word \"fattakh\"  which means \"open\" and \"ov\" in Russian means \"son of,\" which means \"son of open.\" It may mean that someone from this ancestral line was known to be open to person like expressing themselves.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Fathiev",
    "cyrillic": "",
    "checked": "",
    "desc": "Fathiev - last name comes from an Arabic word \"Fathi\" which means \"conqueror\"and \"ev\" in Russian means \"son of.\" It may mean that the son of someone from this ancestral line was known to be a conqueror or took control of their community.",
    "links": "http://www.first-names-meanings.com/name/name-FATHI.html",
    "more": ""
  },
  {
    "latin": "Fathiyev",
    "cyrillic": "",
    "checked": "",
    "desc": "Fathiyev - last name comes from an Arabic word \"Fathi\" which means \"conqueror\" and \"ev\" in Russian means \"son of.\" It may mean that the son of someone It may mean that someone from this ancestral line was known to be a conqueror or took control of their community.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Fatkhiev",
    "cyrillic": "",
    "checked": "",
    "desc": "Fatkhiev - last name comes from an Arabic word \"Fathi\" which means \"conqueror\" and \"ev\" in Russian means \"son of.\" It may mean that the son of someone It may mean that someone from this ancestral line was known to be a conqueror or took control of their community.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Fattahov",
    "cyrillic": "",
    "checked": "",
    "desc": "Fattahov - last name comes from an Arabic word \"fattakh\"  which means \"open\" and \"ov\" in Russian means \"son of,\" which means \"son of open.\" It may mean that someone from this ancestral line was known to be open to person like expressing themselves.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Fattakhov",
    "cyrillic": "",
    "checked": "",
    "desc": "Fattakhov - last name comes from an Arabic word \"fattakh\"  which means \"open\" and \"ov\" in Russian means \"son of,\" which means \"son of open.\" It may mean that someone from this ancestral line was known to be open to person like expressing themselves.",
    "links": "https://translate.google.com/#view=home&op=translate&sl=ar&tl=en&text=%D8%A7%D9%84%D9%81%D8%AA%D8%A7%D8%AD",
    "more": ""
  },
  {
    "latin": "Faylayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Faylayev - last name comes from the word \"faylay\" which means \"knowledge\" and \"ev\" in Russian means \"son of.\" It may mean that the son of someone from this ancestral line was known to be knowledgeable.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Fayzakov",
    "cyrillic": "",
    "checked": "",
    "desc": "Fayzakov - last name comes from the word \"Fayz\" which means \"pleasure\" and \"ov\" in Russian means \"son of,\" which means \"son of pleasure.\" It may mean that someone from this ancestral line was known to be happy or seek pleasure. This was contributed by Gavriel Gavrielov.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Fayzibayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Fayzibayev - last name comes from the word \"Fayz\" which means \"pleasure\" and \"bay\" means \"rich of or full of\" and \"ev\" in Russian means \"son of.\" It may mean that the son of someone from this ancestral line was known to be full of pleasure or happiness. This was contributed by Gavriel Gavrielov.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Fayziyev",
    "cyrillic": "",
    "checked": "",
    "desc": "Fayziyev - last name comes from the word \"Fayz\" which means \"pleasure\" and \"ev\" in Russian means \"son of.\" It may mean that the son of someone from this ancestral line was known to be happy or seek pleasure. This was contributed by Gavriel Gavrielov.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Fazilov",
    "cyrillic": "",
    "checked": "",
    "desc": "Fazilov - last name comes from an Azerbaijani word \"fazil\" which means \"virtue\" and \"ov\" in Russian means \"son of,\" which means \"son of virtue.\" It may mean that someone from this ancestral line was known to have a righteous behavior.",
    "links": "https://translate.google.com/#view=home&op=translate&sl=az&tl=en&text=fazil",
    "more": ""
  },
  {
    "latin": "Filosov",
    "cyrillic": "",
    "checked": "",
    "desc": "Filosov - last name comes from the word \"Pilos\" which means \"philosopher\" and \"ov\" in Russian means \"son of,\" which means \"son of philosopher.\" It may mean that someone from this ancestral line was a philosopher. This name is primarily used by Bukharian Jews.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Fozilov",
    "cyrillic": "",
    "checked": "",
    "desc": "Fozilov - last name comes from the Persian word \"fozil\" which means \"grace\" and \"ov\" in Russian means \"son of,\" which means \"son of grace.\" It may mean that someone from this ancestral line was known to show grace.",
    "links": "https://translate.google.com/#view=home&op=translate&sl=fa&tl=en&text=%D9%81%D8%B6%D9%84",
    "more": ""
  },
  {
    "latin": "Fuzailov",
    "cyrillic": "",
    "checked": "",
    "desc": "Fuzailov - last name comes from the word \"fuzail\" which means \"scholar\" and \"ov\" in Russian means \"son of,\" which means \"son of scholar.\" It may mean that someone from this ancestral line was a well known scholar.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Fuzaylov",
    "cyrillic": "",
    "checked": "",
    "desc": "Fuzaylov - last name comes from the word \"fuzayl\" which means \"scholar\" and \"ov\" in Russian means \"son of,\" which means \"son of scholar.\" It may mean that someone from this ancestral line was a well known scholar.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Fyzailov",
    "cyrillic": "",
    "checked": "",
    "desc": "Fyzailov - last name comes from the word \"Fyzail\" which means \"smart or older\" and \"ov\" in Russian means \"son of,\" which means \"son of smart.\" It may mean that someone older from this ancestral line was known to be smart.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Gadaev",
    "cyrillic": "",
    "checked": "",
    "desc": "Gadaev - last name comes from the word \"gada\" which means \"begging or poverty\" and \"ev\" in Russian means \"son of.\" It may mean that the son of someone from this ancestral line was known for begging a lot or being poor.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Gadayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Gadayev - last name comes from the word \"gada\" which means \"begging or poverty\" and \"ev\" in Russian means \"son of.\" It may mean that the son of someone from this ancestral line was known for begging a lot or being poor.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Gadelov",
    "cyrillic": "",
    "checked": "",
    "desc": "Gadelov - last name comes from the Hebrew word \"Gadel\" which means \"great\" and \"ov\" in Russian \"son of,\" which means \"son of great.\" It may mean that someone from this ancestral line was for being great at a skill or profession.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Gadoyev",
    "cyrillic": "",
    "checked": "",
    "desc": "Gadoyev - last name comes from the word \"gado\" which means \"begging or poverty\" and \"ev\" in Russian means \"son of.\" It may mean that the son of someone from this ancestral line was known for begging a lot or being poor.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Galibov",
    "cyrillic": "",
    "checked": "",
    "desc": "Galibov - last name comes from the word “Galib” which means “winner or lucky” and “ov” in Russian means “son of,” which means “son of winner.” It may mean that someone from this ancestral line was known to be a winner for playing games. The name “Galib” also comes from an old name used in a Bukharian community. This was contributed by Gavriel Gavrielov.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Gavrielov",
    "cyrillic": "",
    "checked": "",
    "desc": "Gavrielov - last name comes from the Hebrew name \"Gavriel or Gabriel\" which means \"my strength is God.\" The Russian word \"ov\" means \"son of,\" which means \"son of strength.\" It may mean that someone from this ancestral line was known for their strength.",
    "links": "http://www.thinkbabynames.com/meaning/1/Gavriel",
    "more": ""
  },
  {
    "latin": "Gavriyelov",
    "cyrillic": "",
    "checked": "",
    "desc": "Gavriyelov - last name comes from the Hebrew name \"Gavriel or Gabriel\" which means \"my strength is God.\" The Russian word \"ov\" means \"son of,\" which means \"son of strength.\" It may mean that someone from this ancestral line was known for their strength.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Gilkarov",
    "cyrillic": "",
    "checked": "",
    "desc": "Gilkarov - last name comes from the word \"gil\" which means \"plaster\" and \"ov\" in Russian means \"son of,\" which means \"son of gilkar.\" The word \"kar\" means \"worker.\" It may mean that someone from this ancestral line was known to work as a job to put plaster on walls and put up bricks with cement. This was contributed by Gavriel Gavrielov.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Godaev",
    "cyrillic": "",
    "checked": "",
    "desc": "Godaev - last name comes from the word \"goda\" which means \"begging or poverty\" and \"ev\" in Russian means \"son of.\" It may mean that the son of someone from this ancestral line was known for begging a lot or being poor.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Godelov",
    "cyrillic": "",
    "checked": "",
    "desc": "Godelov - last name comes from the Hebrew word \"godel\" which means \"great\" and \"ov\" in Russian \"son of,\" which means \"son of great.\" It may mean that someone from this ancestral line was for being great at a skill or profession.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Gulkarov",
    "cyrillic": "",
    "checked": "",
    "desc": "Gulkarov - last name comes from the words \"gul\" which means \"flower\" and \"kar\" means \"worker\" or in other words \"florist.\" The Russian word \"ov\" means \"son of,\" which means \"son of florist.\" It may mean that someone from this ancestral line was known to be a florist. This name is primarily used by Bukharian Jews.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Gurchiev",
    "cyrillic": "",
    "checked": "",
    "desc": "Gurchiev - last name comes from the word \"gurchi\" which means \"short-tempered\" and \"ev\" in Russian means \"son of.\" It may mean that the son of someone from this ancestral line was a short-tempered individual. This name is primarily used Bukharian Jews.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Gurgov",
    "cyrillic": "",
    "checked": "",
    "desc": "Gurgov - last name comes from the Tajik word \"gurg\" which means \"a wolf\" and \"ov\" in Russian means \"son of,\" which means \"son of a wolf.\" It may mean that someone from this ancestral line had teeth sharp as a wolf's. The word \"gurg\" was given a nickname to children born with teeth. The name \"Gurgov\" also means \"Silkroad.\" Bukharian Jews believed that if they give a name of an animal to a child to give them strength, live longer and to have endurance such as wolf. The reason for this was to prevent children from dying at a young age. This name is primarily used by Bukharian Jews.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Gurjiev",
    "cyrillic": "",
    "checked": "",
    "desc": "Gurjiev - last name comes from where Georgians were once called Gurzh/Gurj people under the rule of the Persian empires from 536 BC-AD 638 and \"ev\" in Russian means \"son of.\" It may mean that the son of someone from that family from this ancestral line had lived in Georgia.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Gurzhiev",
    "cyrillic": "",
    "checked": "",
    "desc": "Gurzhiev - last name comes from where Georgians were once called Gurzh/Gurj people under the rule of the Persian empires from 536 BC-AD 638 and \"ev\" in Russian means \"son of.\" It may mean that the son of someone from that family from this ancestral line had lived in Georgia.",
    "links": "http://stryder.com/docs/loam/sun/Georgia_(country)_wikipedia_aug08.html",
    "more": ""
  },
  {
    "latin": "Hahamov",
    "cyrillic": "",
    "checked": "",
    "desc": "Hahamov - last name comes from the Hebrew word \"Haham\" which means \"scholar\" and \"ov\" in Russian means \"son of,\" which means \"son of scholar.\" It may mean that someone from this ancestral line was known to be well-educated.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Haimoff",
    "cyrillic": "",
    "checked": "",
    "desc": "Haimoff - last name comes from a Hebrew name \"Chaim\" and \"ov\" in Russian means \"son of\" which means \"son of Chaim.\" This was primarily used by the Bukharian Jews and Mountain (Kavkazi) Jews. Also, the root \"Hai\" from Hebrew means \"Life\" and is the numerical value of \"18.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Haimov",
    "cyrillic": "",
    "checked": "",
    "desc": "Haimov - last name comes from a Hebrew name \"Chaim\" and \"ov\" in Russian means \"son of\" which means \"son of Chaim.\" This was primarily used by the Bukharian Jews and Mountain (Kavkazi) Jews. Also, the root \"Hai\" from Hebrew means \"Life\" and is the numerical value of \"18.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Hanimov",
    "cyrillic": "Khanimov",
    "checked": "",
    "desc": "Hanimov - last name comes from the uzbek word \"Honim\" which means \"madam\" and ov means son of.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Havasov",
    "cyrillic": "",
    "checked": "",
    "desc": "Havasov - last name comes from the word \"Havas\" which means \"a grinding mill used to wheat into flour\" and \"ov\" in Russian means \"son of.\" It may mean that the son of someone or a group of family members were known for being farmers and using a grinding mill to make wheat into flour. This was contributed by Gavriel Gavrielov.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Hayfizov",
    "cyrillic": "",
    "checked": "",
    "desc": "Hayfizov - last name comes from the word \"Hayfiz\" which means \"singer\" and \"ov\" in Russian means \"son of,\" which means \"son of singer.\" It may mean that someone or a group of family members from this ancestral line were known to be singers. This was contributed by Gavriel Gavrielov.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Hiyayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Hiyayev - last name comes from the word \"hiya\" which means \"heart\" and \"ev\" in Russian means \"son of.\" It may mean that the son of someone from this ancestral line was known to have a big heart to others.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Hizyakov",
    "cyrillic": "",
    "checked": "",
    "desc": "Hizyakov - last name comes from the word \"hizyak\" which means \"dried flat cow dung used for burning\" and \"ov\" in Russian means \"son of.\" It may mean that the son of someone or a group of family members from this ancestral line were known to use dried flat cow dungs as fire for cooking.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Hofizov",
    "cyrillic": "",
    "checked": "",
    "desc": "Hofizov - last name comes from the word \"Hofiz\" which means \"singer\" and \"ov\" in Russian means \"son of,\" which means \"son of singer.\" It may mean that someone or a group of family members from this ancestral line were known to be singers. This was contributed by Gavriel Gavrielov.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Hosidov",
    "cyrillic": "",
    "checked": "",
    "desc": "Hosidov - last name comes from the word \"Hosid\" which means \"hasidic\". It may mean that someone from this ancestral line was a Hasidic Jew. This name is primarily used by Bukharian Jews.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Ibragimov",
    "cyrillic": "",
    "checked": "",
    "desc": "Ibragimov - last name comes from the Hebrew name \"Ibragim\" means \"father of many.\" Ibragim is Abraham in Arabic. Abraham was the son of Terah and patriarch of both the Hebrews and Arabs. He was the husband of Sarah and the father of Ishmael and Isaac. Ibragimov could also mean that a male family member from this ancestral line was a father of many children and was given the nickname.",
    "links": "http://www.babynamewizard.com/baby-name/boy/ibragim",
    "more": ""
  },
  {
    "latin": "Iglanov",
    "cyrillic": "",
    "checked": "",
    "desc": "Iglanov - lthis last name come from \"lakam\" - nick name that was \"Eglyn\" wich is hebrew word that means \"cabman, driver, coachman\" and was russifaed into \"Igan\" and \"ov\" means \"son of\" - Iglanov means \"son of the cabman\".",
    "links": "",
    "more": ""
  },
  {
    "latin": "Ilatov",
    "cyrillic": "",
    "checked": "",
    "desc": "Ilatov - last name comes from the word hebrew name \"El-yad\" and \"ov\" means \"son of",
    "links": "",
    "more": ""
  },
  {
    "latin": "Ilizarov",
    "cyrillic": "",
    "checked": "",
    "desc": "Ilizarov - last name comes from the Hebrew name \"Eliezer\" which means \"help of my God.\" Eliezer was the second son of Moses and Zipporah.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Ilyabayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Ilyabayev - last name comes from the word \"Ilya\" goes by the Hebrew name “Eliyah” which means “My God is he\" and the word \"bay\" means \"rich.",
    "links": "http://www.babynamewizard.com/baby-name/boy/ilya",
    "more": ""
  },
  {
    "latin": "Ilyadzhanov",
    "cyrillic": "",
    "checked": "",
    "desc": "Ilyadzhanov - last name comes from the name \"Ilya\" goes by the Hebrew name “Eliyahu” which means “My God is he\" and \"ov\" in Russian means \"son of,\" and the word \"dzhan\" means \"soul, life\" wich makes it more sweater way f saying it.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Ilyaich",
    "cyrillic": "",
    "checked": "",
    "desc": "Ilyaich - last name comes from the word \"Ilya\" goes by the Hebrew name “Eliyah” which means “My God is he.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Ilyasov",
    "cyrillic": "",
    "checked": "",
    "desc": "Ilyasov - last name comes from the Hebrew name \"Ilyas\" which means \"My God is the lord\" and \"ov\" in Russian means \"son of\".",
    "links": "https://www.thenamemeaning.com/ilyas/",
    "more": ""
  },
  {
    "latin": "Ilyaviev",
    "cyrillic": "",
    "checked": "",
    "desc": "Ilyaviev - last name comes from the word \"Ilya\" goes by the Hebrew name “Eliyah” which means “My God is he\" and \"ev\" in Russian means \"son of.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Ilyayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Ilyayev - last name comes from the word \"Ilya\" goes by the Hebrew name “Eliyah” which means “My God is he\" and \"ev\" in Russian means \"son of.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Inoyatov",
    "cyrillic": "",
    "checked": "",
    "desc": "Inoyatov - last name comes from the word \"Inoyat\" which means \"helper\" and \"ov\" in Russian means \"son of,\" which means \"son of helper.\" It may mean that someone this ancestral line was known to be an assistant or was known for helping people. This name is primarily by Bukharian Jews.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Isakov",
    "cyrillic": "",
    "checked": "",
    "desc": "Isakov - last name comes from the word \"isak\" which comes from the Hebrew name \"Isaac.\" The name \"Isaac\" means \"laugh\" and \"ov\" in Russian means \"son of,\" which means \"son of laugh.\" It may mean that someone from this ancestral line was known to tell jokes.",
    "links": "https://en.wikipedia.org/wiki/Isakov",
    "more": ""
  },
  {
    "latin": "Iskhakbayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Iskhakbayev - last name comes from the word \"Iskhak\" goes by the Hebrew name \"Yitzhak or Isaac\" which means \"he will laugh\" and the word \"bay\" means \"rich.",
    "links": "http://www.babynamewizard.com/baby-name/boy/yitzhak",
    "more": ""
  },
  {
    "latin": "Iskhakov",
    "cyrillic": "",
    "checked": "",
    "desc": "Iskhakov - last name comes from the word \"Iskhak\" goes by the Hebrew name \"Yitzhak or Isaac\" which means \"he will laugh\" and \"ov\" in Russin means \"son of,\" which means \"son of laugh.\" It may mean that someone from this ancestral line was known to tell jokes.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Isakharov",
    "cyrillic": "",
    "checked": "",
    "desc": "Isakharov - last name comes from the Jewish name \"Isokhor\" and \"ov\" means son of. Full name means \"Son of Isokhor",
    "links": "",
    "more": ""
  },
  {
    "latin": "Israelov",
    "cyrillic": "",
    "checked": "",
    "desc": "Israelov - last name comes from the word \"Israel\" which means \"Israeli.\" It may mean that someone from this ancestral line came from Israel and/or the remaining twelve tribes of Israel (which do not include Cohen and Levi). This name is primarily used by Bukharian Jews.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Israilov",
    "cyrillic": "",
    "checked": "",
    "desc": "Israilov - last name comes from the word \"Israel\" which means \"Israeli\" and \"ov\" in Russian means \"son of.\" It may mean that the son of someone fro  this ancestral line came from Israel and/or the remaining twelve tribes of Israel (which do not include Cohen and Levi). This name is primarily used by Bukharian Jews.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Issakharov",
    "cyrillic": "",
    "checked": "",
    "desc": "Issakharov - Isakharov - last name comes from the Jewish name \"Isokhor\" and \"ov\" means son of. Full name means \"Son of Isokhor",
    "links": "",
    "more": ""
  },
  {
    "latin": "Itzhakov",
    "cyrillic": "Ицхаков",
    "checked": "",
    "desc": "Itzhakov - last name comes from a Hebrew word “Itzhak\" which means “laugh” and \"ov\" in Russian means \"son of\" which means \"son of laugh.” It may mean that someone from this ancestral line was known to make people laugh by telling jokes. This name was primarily used by the Bukharian Jews.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Itzkhakov",
    "cyrillic": "",
    "checked": "",
    "desc": "Itzkhakov - last name comes from a Hebrew word “Itzhak\" which means “laugh” and \"ov\" in Russian means \"son of\" which means \"son of laugh.” It may mean that someone from this ancestral line was known to make people laugh by telling jokes. This name was primarily used by the Bukharian Jews.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Ivanov",
    "cyrillic": "",
    "checked": "",
    "desc": "Ivanov - last name comes from the Hebrew name \"Ivan\" which means \"gracious\" and \"ov\" in Russian means \"son of,\" which means \"son of gracious.\" It may mean that someone from this ancestral line was known to be polite and kind to others.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Izhakoff",
    "cyrillic": "",
    "checked": "",
    "desc": "Izhakoff - last name comes from a Hebrew word “Izhak\" which means “laugh.\" It may mean that someone from this ancestral line was known to make people laugh by telling jokes. This name was primarily used by the Bukharian Jews.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Izhakov",
    "cyrillic": "",
    "checked": "",
    "desc": "Izhakov - last name comes from a Hebrew word “Izhak\" which means “laugh” and \"ov\" in Russian means \"son of\" which means \"son of laugh.” It may mean that someone from this ancestral line was known to make people laugh by telling jokes. This name was primarily used by the Bukharian Jews.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Izhakow",
    "cyrillic": "",
    "checked": "",
    "desc": "Izhakow - last name comes from a Hebrew word “Izhak\" which means “laugh.\" It may mean that someone from this ancestral line was known to make people laugh by telling jokes. This name was primarily used by the Bukharian Jews.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Izgelov",
    "cyrillic": "",
    "checked": "",
    "desc": "Izgelov - last name comes from the word \"Izgel\" goes by the Hebrew name \"Ezekiel or Yehezkel\" which means \"God will strengthen.\" The Russian word \"ov\" means \"son of,\" which means \"son of strengthen.\" This lastname comes from the name Khiskiel, Yehezekel, that later becomes last name. Very prominante amoungs Bukharian and Kavkazi Jews.",
    "links": "https://www.behindthename.com/name/ezekiel",
    "more": ""
  },
  {
    "latin": "Izrailov",
    "cyrillic": "",
    "checked": "",
    "desc": "Izrailov - last name comes from the word \"Israel\" which means \"Israeli.\" It may mean that someone from this ancestral line came from Israel and/or the remaining twelve tribes of Israel (which do not include Cohen and Levi). This name is primarily used by Bukharian Jews.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Jachobov",
    "cyrillic": "",
    "checked": "",
    "desc": "Jachobov - last comes from the Farsi words “Yah” which means “cold” and “Ob” means “water.” Some descendants of surname ended up with Yakobov or Yakubov in the process of immigration and the following transliterations. The last name has a different meaning from Yakubov. The Russian word “ov” means “son of,” which means “son of cold water.”",
    "links": "",
    "more": ""
  },
  {
    "latin": "Jakobov",
    "cyrillic": "",
    "checked": "",
    "desc": "Jakobov - last comes from the Farsi words “Yah” which means “cold” and “Ob” means “water.” Some descendants of surname ended up with Yakobov or Yakubov in the process of immigration and the following transliterations. The last name has a different meaning from Yakubov. The Russian word “ov” means “son of,” which means “son of cold water.”",
    "links": "",
    "more": ""
  },
  {
    "latin": "Jakubov",
    "cyrillic": "",
    "checked": "",
    "desc": "Jakubov - last comes from the Farsi words “Yah” which means “cold” and “Ob” means “water.” Some descendants of surname ended up with Yakobov or Yakubov in the process of immigration and the following transliterations. The last name has a different meaning from Yakubov. The Russian word “ov” means “son of,” which means “son of cold water.”",
    "links": "",
    "more": ""
  },
  {
    "latin": "Kakuriev",
    "cyrillic": "",
    "checked": "",
    "desc": "Kakuriev - last name comes from the word ",
    "links": "",
    "more": ""
  },
  {
    "latin": "Kakzanov",
    "cyrillic": "",
    "checked": "",
    "desc": "Kakzanov - last name comes from two words \"ko[a]k\" which means \"skinny\" and \"zan\" means \"woman.\" The Russian word \"ov\" means \"son of,\" which means \"son of skinny woman.\" It may mean that a woman or a group of female family members from this ancestral line were known to be extremely skinny. Also, according to Kaylan, the word \"kakzan\" was used as a method to dry meat.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Kalandarov",
    "cyrillic": "",
    "checked": "",
    "desc": "Kalandarov - last name comes from the word \"kalandar\" which means \"traveler\" and \"ov\" in Russian means \"son of,\" which means \"son of kalandar.\" It may mean that someone from this ancestral line was known to be a traveler or loves traveling.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Kalendarov",
    "cyrillic": "",
    "checked": "",
    "desc": "Kalendarov - last name comes from the Russian word \"kalendar\" which means \"the calendar\" and \"ov\" in Russian means \"son of,\" which means \"son of the calendar.\" It may mean that someone from this ancestral line has known all the dates, months and years of a calendar by head.",
    "links": "https://translate.google.com/#view=home&op=translate&sl=en&tl=ru&text=The%20calendar",
    "more": ""
  },
  {
    "latin": "Kalendaryov",
    "cyrillic": "",
    "checked": "",
    "desc": "Kalendaryov - last name comes from the Russian word \"kalendar\" which means \"the calendar\" and \"ov\" in Russian means \"son of,\" which means \"son of the calendar.\" It may mean that someone from this ancestral line has known all the dates, months and years of a calendar by head.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Kalontarov",
    "cyrillic": "",
    "checked": "",
    "desc": "Kalontarov - last name comes from the word \"kalontar\" which means “leader” and “ov” in Russian means “son of,” which means “son of leader.” It may mean that someone from this ancestral line was the head of a community, such as a community leader. This name is primarily used by Bukharian Jews.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Kandchorov",
    "cyrillic": "",
    "checked": "",
    "desc": "Kandchorov - last name comes from the word ",
    "links": "",
    "more": ""
  },
  {
    "latin": "Kandhorov",
    "cyrillic": "",
    "checked": "",
    "desc": "Kandhorov - last name comes from the word \"kandhor\" which means \"a matchmaker\" and \"ov\" in Russian means \"son of,\" which means \"son of a matchmaker.\" It may mean that someone from this ancestral line was a matchmaker for marriages. The word \"kand\" also means \"candy\" which is a symbolic gesture of agreement to wed.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Kandinov",
    "cyrillic": "",
    "checked": "",
    "desc": "Kandinov - last name comes from the Hebrew word \"kandin\" which means \"candy\" and \"ov\" in Russian means \"son of,\" which means \"son of candy.\" It may mean that someone from this ancestral line was known to work or owned a candy shop.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Kandkorov",
    "cyrillic": "",
    "checked": "",
    "desc": "Kandkorov - last name comes from the word \"kandkor\" which means \"a matchmaker\" and \"ov\" in Russian means \"son of,\" which means \"son of a matchmaker.\" It may mean that someone from this ancestral line was a matchmaker for marriages. The word \"kand\" also means \"candy\" which is a symbolic gesture of agreement to wed.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Kandov",
    "cyrillic": "",
    "checked": "",
    "desc": "Kandov - last name comes from the word \"kand\" which means \"candy or sugar\" and \"ov\" in Russian means \"son of,\" which means \"son of candy.\" It may mean that someone from this ancestral line worked at a candy shop or loves to eat a lot of sugary candies. This name is primarily used by Bukharian Jews.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Kariyev",
    "cyrillic": "",
    "checked": "",
    "desc": "Kariyev - last name comes from the word ",
    "links": "",
    "more": ""
  },
  {
    "latin": "Karshigiev",
    "cyrillic": "",
    "checked": "",
    "desc": "Karshigiev - last name comes from the word \"Karshi\" which comes from the name of the city Qarshi in Uzbekistan. The ancestral name were originally from Samarkand. Then it was stranded in Qarshi and was nicknamed Karshigi.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Kataev",
    "cyrillic": "",
    "checked": "",
    "desc": "Kataev - last name comes from the word \"Katta\" which means \"huge/big\" and \"ev\" in Russian means \"son of.\" It may mean that the son of someone from this ancestral line could have been big in a varierity of ways such as, being big in physical size or big in the community/business. This name is primarily used by Bukharian Jews.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Katanov",
    "cyrillic": "",
    "checked": "",
    "desc": "Katanov - last name comes from the Hebrew word \"katan\" which means \"small\" and \"ov\" in Russian means \"son of,\" which means \"son of small.\" It may mean that someone from this ancestral line was known to be small.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Katayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Katayev - last name comes from the word \"Katta\" hich means \"huge/big\" and \"ev\" in Russian means \"son of.\" It may mean that the son of someone from this ancestral line could have been big in a varierity of ways such as, being big in physical size or big in the community/business. This name is primarily used by Bukharian Jews.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Kattaev",
    "cyrillic": "",
    "checked": "",
    "desc": "Kattaev - last name comes from the word \"Katta\" hich means \"huge/big.\" It may mean that someone from this ancestral line could have been big in a varierity of ways such as, being big in physical size or big in the community/business. This name is primarily used by Bukharian Jews.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Kaykov",
    "cyrillic": "",
    "checked": "",
    "desc": "Kaykov - last name comes from the word \"kayk\" which means \"tick\" and \"ov\" in Russian means \"son of,\" which means \"son of tick.\" It may mean that someone or a group of family members were known to be quick and always on the move. This was contributed by Gavriel Gavrielov.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Kaylakov",
    "cyrillic": "",
    "checked": "",
    "desc": "Kaylakov - last name comes from the word \"kaylak",
    "links": "",
    "more": ""
  },
  {
    "latin": "Kayumov",
    "cyrillic": "",
    "checked": "",
    "desc": "Kayumov - last name comes from the word \"kayum",
    "links": "",
    "more": ""
  },
  {
    "latin": "Kazakov",
    "cyrillic": "",
    "checked": "",
    "desc": "Kazakov - last name comes from the word \"kazak\" which means \"strong\" and \"ov\" in Russian means \"son of,\" which means \"son of strong.\" It may mean that someone from this ancestral line was known to be strong.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Kaziev",
    "cyrillic": "",
    "checked": "",
    "desc": "Kaziev - last name comes from the word \"kazi\" which means \"a judge\" and \"ev\" in Russian means \"son of.\" It may mean that the son of someone from this ancestral line was known to be a judge.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Kaziyev",
    "cyrillic": "",
    "checked": "",
    "desc": "Kaziyev - last name comes from the word \"kazi\" which means \"a judge\" and \"ev\" in Russian means \"son of.\" It may mean that the son of someone from this ancestral line was known to be a judge.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Khafizov",
    "cyrillic": "",
    "checked": "",
    "desc": "Khafizov - last name comes from the word \"khafiz\" which means \"musician or singer\" and \"ov\" in Russian means \"son of,\" which means \"son of musician.\" It may mean that someone from this ancestral line was a well known musician or singer.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Khaimchayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Khaimchayev - last name comes from the Hebrew name \"Khaim\" whcih means \"life\" and \"chay\" in Uzbek means \"tea\"?",
    "links": "",
    "more": ""
  },
  {
    "latin": "Khaimov",
    "cyrillic": "Хаимов, Хаймов",
    "checked": "חַיִּימוֹב",
    "desc": "Khaimov - last name comes from a Hebrew name \"Chaim\" and \"ov\" in Russian means \"son of\" which means \"son of Chaim.\" This was primarily used by the Bukharian Jews and Mountain (Kavkazi) Jews. Also, the root \"Hai\" from Hebrew means \"Life\" and is the numerical value of \"18.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Khajayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Khajayev - last name comes from an Arabic word \"Khod or Khaj\" which means \"pilgrimage\" and was usually taken to Mecca, Saudi Arabia. This surname was also used for those made a pligrimage to Israel. This was contributed by Gavriel Gavrielov.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Khakhamov",
    "cyrillic": "",
    "checked": "",
    "desc": "Khakhamov - last name comes from the Tajik word \"khakham\" which means \"a person\" and \"ev\" in Russian means \"son of.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Khamomi",
    "cyrillic": "",
    "checked": "",
    "desc": "Khamomi - last name comes from an Arabic means \"bath/sauna.\" It may mean that someone from this ancestral line was known to build baths and saunas. The first person who received this nickname was Docidi Khamomi, who build Khamom in Samarkand, Uzbekistan, an old city that still exist today.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Khanimov",
    "cyrillic": "",
    "checked": "",
    "desc": "Khanimov - Hanimov - last name comes from the uzbek word \"Honim\" which means \"madam\" and ov means son of.",
    "links": "Hanimov",
    "more": ""
  },
  {
    "latin": "Khavasov",
    "cyrillic": "",
    "checked": "",
    "desc": "Khavasov - last name has the same meaning as Havasov that comes from the word \"khavas or havas\" which means \"a grinding mill used to wheat into flour.\" It may mean that someone or a group of family members were known for being farmers and using a grinding mill to make wheat into flour. This was contributed by Gavriel Gavrielov.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Khasidov",
    "cyrillic": "",
    "checked": "",
    "desc": "Khasidov - last name comes from the Hebrew word \"khassid\" which means \"follower\" and \"ov\" in Russian means \"son of,\" which means \"son of follower.\" It may mean that someone from this ancestral line was known to be a follower.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Khassidov",
    "cyrillic": "",
    "checked": "",
    "desc": "Khassidov - last name comes from the Hebrew word \"khassid\" which means \"follower\" and \"ov\" in Russian means \"son of,\" which means \"son of follower.\" It may mean that someone from this ancestral line was known to be a follower.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Khiyayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Khiyayev - last name comes from the word \"hiya\" which means \"heart\" and \"ev\" in Russian means \"son of.\" This last name came from the name Khiya - the name one of the Tanaim during talmuduc time.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Kholdarov",
    "cyrillic": "",
    "checked": "",
    "desc": "Kholdarov - last name comes from the word \"khold\" which means \"mole or birthmark\" and \"ov\" in Russian means \"son of,\" which means \"son of birthmark.\" It may mean that someone and a group of family members from this ancestral line was known to have moles or unique birthmarks.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Khodzhaev",
    "cyrillic": "",
    "checked": "",
    "desc": "Khodzhaev - last name comes from an Arabic word \"Khod or Khaj\" which means \"pilgrimage\" and was usually taken to Mecca, Saudi Arabia. This surname was also used for those made a pligrimage to Israel. This was contributed by Gavriel Gavrielov.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Khodzhayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Khodzhayev - last name comes from an Arabic word \"Khod or Khaj\" which means \"pilgrimage\" and was usually taken to Mecca, Saudi Arabia. This surname was also used for those made a pligrimage to Israel. This was contributed by Gavriel Gavrielov.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Khofizov",
    "cyrillic": "",
    "checked": "",
    "desc": "Khofizov - last name comes from the word \"khofiz\" which means \"musician or singer\" and \"ov\" in Russian means \"son of,\" which means \"son of musician.\" It may mean that someone from this ancestral line was a well known musician or singer.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Khojainov",
    "cyrillic": "",
    "checked": "",
    "desc": "Khojainov - last name comes from the word ",
    "links": "",
    "more": ""
  },
  {
    "latin": "Khudaidatov",
    "cyrillic": "",
    "checked": "",
    "desc": "Khudaidatov - last name comes from two words \"khuda\" which means \"God\" and \"dat\" means \"given\" and \"ov\" in Russian means \"son of.\" It may mean that the son of someone from this ancestral line was known to be a giver to others.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Khudaydatov",
    "cyrillic": "",
    "checked": "",
    "desc": "Khudaydatov - last name comes from two words \"khuda\" which means \"God\" and \"dat\" means \"given\" and \"ev\" in Russian means \"son of.\" It may mean that the son of someone from this ancestral line was known to be a giver to others.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Kichikov",
    "cyrillic": "",
    "checked": "",
    "desc": "Kichikov - last name comes from an Uzbek word \"kichik\" which means \"small\" and \"ov\" in Russian means \"son of,\" which means \"son of small.\" It may mean that someone from this ancestral line was known to have a small height.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Kikirov",
    "cyrillic": "",
    "checked": "",
    "desc": "Kirkirov - last name comes from the word \"kirkir\" which means \"uncontrollable laughter\" and \"ov\" in Russian means \"son of.\" It may mean that the son of someone from this ancestral line had an uncontollable laughter. It is often assumed that people with this last name are very cheerful people. This name is often used by Bukharian Jews.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Kimegarov",
    "cyrillic": "",
    "checked": "",
    "desc": "Kimegarov - last name comes from the word \"kimega\" which means \"chemist\" and \"ov\" in Russian means \"son of,\" which means \"son of chemist.\" It may mean that someone from this ancestral line was a very well known chemist or dealt with chemistry. This name is primarily used by Bukharian Jews.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Kimyagarov",
    "cyrillic": "",
    "checked": "",
    "desc": "Kimyagarov - last name comes from the word \"kimega\" which means \"chemist\" and \"ov\" in Russian means \"son of,\" which means \"son of chemist.\" It may mean that someone from this ancestral line was a very well known chemist or dealt with chemistry. This name is primarily used by Bukharian Jews.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Kimiyagarov",
    "cyrillic": "",
    "checked": "",
    "desc": "Kimiyagarov - last name comes from the word \"kimega\" which means \"chemist\" and \"ov\" in Russian means \"son of,\" which means \"son of chemist.\" It may mean that someone from this ancestral line was a very well known chemist or dealt with chemistry. This name is primarily used by Bukharian Jews.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Kiskiyev",
    "cyrillic": "",
    "checked": "",
    "desc": "Kiskiyev - last name comes from an Uzbek word \"kiski\" which means \"short\" and \"ev\" in Russian means \"son of.\" It may mean that the son of someone from this ancestral line was known to be short.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Klimankov",
    "cyrillic": "",
    "checked": "",
    "desc": "Klimankov - last name comes from the word ",
    "links": "",
    "more": ""
  },
  {
    "latin": "Kluyov",
    "cyrillic": "",
    "checked": "",
    "desc": "Kluyov - last name comes from the word ",
    "links": "",
    "more": ""
  },
  {
    "latin": "Koenov",
    "cyrillic": "",
    "checked": "",
    "desc": "Koenov - last name comes from the Hebrew title \"Cohen\" and \"ov\" in Russian means \"son of,\" which means \"son of a Cohen.\" Cohanim (priests) are from one of the 12 tribes of Israel - \"Tribe Levi\". Many people with this last name have a lineage tracing back toward the priestly tribe of Levi and Aron the Cohen Gadol (high priest), brother of Moses. This name is primarily used by Bukharian Jews.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Koknariev",
    "cyrillic": "",
    "checked": "",
    "desc": "Koknariev - last name comes from the word \"koknar\" which means \"tea infused with poppy seeds.\" The Russian suffix \"ev\" means \"son of.\" Altogether, the name means \"son of tea infuesd poppy seeds\". It may mean that someone from this ancestral line was known to make tea with poppy seeds.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Kokuriev",
    "cyrillic": "",
    "checked": "",
    "desc": "Kokuriev - last name comes from the word \"kokuri\" which means \"blink or twitch.\" The Russian suffix \"ev\" means \"son of.\" Altogether, the name means \"son of blink.\" It may mean that someone from this ancestral line had a twitchy eye.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Koldanov",
    "cyrillic": "",
    "checked": "",
    "desc": "Koldanov - last comes from the word ",
    "links": "",
    "more": ""
  },
  {
    "latin": "Koptiyev",
    "cyrillic": "",
    "checked": "",
    "desc": "Koptiyev - last name comes from the word \"kopti\" which means ",
    "links": "",
    "more": ""
  },
  {
    "latin": "Koyenov",
    "cyrillic": "",
    "checked": "",
    "desc": "Koyenov - last name comes from the Hebrew title \"Cohen\" and \"ov\" in Russian means \"son of,\" which means \"son of a Cohen.\" Cohanim (priests) are from one of the 12 tribes of Israel - \"Tribe Levi\". Many people with this last name have a lineage tracing back toward the priestly tribe of Levi and Aron the Cohen Gadol (high priest), brother of Moses. This name is primarily used by Bukharian Jews.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Koziev",
    "cyrillic": "",
    "checked": "",
    "desc": "Koziev - last name comes from the word \"kozi\" which means \"a judge.\" The Russian suffix \"ev\" means \"son of.\" Altogether, the name means \"son of Judge.\"  It may mean that someone from this ancestral line was known to be a judge.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Kuinov",
    "cyrillic": "",
    "checked": "",
    "desc": "Kuinov - last name comes from the Tajik word \"kuin\" which means \"laugh\" and \"ov\" in Russian means \"son of,\" which means \"son of laugh.\" It may mean that someone from this ancestral line was known to tell jokes to others.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Kuknariev",
    "cyrillic": "",
    "checked": "",
    "desc": "Kuknariev - last name comes from the word \"kokuri\" which means \"blink or twitch.\" The Russian suffix \"ev\" means \"son of.\" Altogether, the name means \"son of blink.\" It may mean that someone from this ancestral line had a twitchy eye.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Kulangiev",
    "cyrillic": "",
    "checked": "",
    "desc": "Kulangiev - last name comes from the word \"kulangi\" which means \"stocky built person.\" The Russian suffix \"ev\" means \"son of.\" Altogether, the name means \"son of stocky built person.\" It may mean that someone from this ancestral line was known to be short with a strong, stocky body.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Kulangi",
    "cyrillic": "",
    "checked": "",
    "desc": "Kulangi - last name comes from the word \"kulangi\" which means \"stocky built person.\" It may mean that someone from this ancestral line was known to be short with a strong, stocky body.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Kuraev",
    "cyrillic": "",
    "checked": "",
    "desc": "Kuraev - last name comes from the word \"kura\" which means \"silk seller.\" The word \"kura\" could also mean kipa maker. The Russian suffix \"ev\" means \"son of.\" Altogether, the name means \"son of silk seller.\" It may mean that someone or a group of a family members from this ancestral line were known to sell silk and make kipas.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Kurayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Kurayev - last name comes from the word \"kura\" which means \"silk seller.\" The word \"kura\" could also mean kipa maker. The Russian suffix \"ev\" means \"son of.\" Altogether, the name means \"son of silk seller.\" It may mean that someone or a group of a family members from this ancestral line were known to sell silk and make kipas.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Kusayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Kusayev - last name comes from the word \"kusa\" which means \"bent or twisted.\" The Russian suffix \"ev\" means \"son of.\" Altogether, the name means \"son of bent.\" The nickname \"kusa\" was given to elderly male ancestors who had breads that would grow bent or twisted.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Kyilak",
    "cyrillic": "",
    "checked": "",
    "desc": "Kyilak - last name comes an Uzbek word \"kyilak\" which means \"atlas dress,\" which is a slik, rich traditional dress. It may mean that someone from this ancestral line was known to be a master of making traditional silk atlas dresses.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Kylangiyev",
    "cyrillic": "",
    "checked": "",
    "desc": "Kylangiyev - last name comes from the word \"kylangi\" which means \"burly or portly.\" The Russian suffix \"ev\" means \"son of.\" Altogether, the name means \"son of burly.\"  It may mean that someone from this ancestral line was known to be a large, muscular person.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Kyraev",
    "cyrillic": "",
    "checked": "",
    "desc": "Kyraev - last name comes from the word \"kyra\" which means \"fence.\" The Russian suffix \"ev\" means \"son of.\" Altogether, the name means \"son of fence.\" It may mean that someone from this ancestral line was known to build fences.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Kysaev",
    "cyrillic": "",
    "checked": "",
    "desc": "Kysaev - last name comes from the word \"kysa\" which means \"no beard.\" The Russian suffix \"ev\" means \"son of.\" Altogether, the name means \"son of no beard.\" It may mean that an elderly man from this ancestral line was known to not a bread.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Ladaev",
    "cyrillic": "",
    "checked": "",
    "desc": "Ladaev - last name comes from the word \"lada\" which means ",
    "links": "",
    "more": ""
  },
  {
    "latin": "Lailiev",
    "cyrillic": "",
    "checked": "",
    "desc": "Lailiev - last name comes from the Hebrew name \"Laili\" which means nightfall.\" Nightfall refers to someone from this ancestral line to be a party maniac that parties on evenings. The name \"Laili\" can also mean in Uzbek \"purposeless.\" The Russian suffix \"ev\" means \"son of.\" Altogether, the name means \"son of purposeless.\" A person who got this nickname was purposeless or careless.",
    "links": "https://www.everydayfamily.com/baby-names/name/laili/",
    "more": ""
  },
  {
    "latin": "Lakchakev",
    "cyrillic": "",
    "checked": "",
    "desc": "Lakchakev - last name comes from the word \"lakchak\" which means \"a dish made of boiled dough.\" The Russian suffix \"ev\" means \"son of.\" Altogether, the name means \"son of Lakchak.\" It may mean that someone or a group of family members were known to make a famous boiled dough dish.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Lalmiyev",
    "cyrillic": "",
    "checked": "",
    "desc": "Lalmiyev - last name comes from the word \"lalmi\" which was referred to things that grew on top of mountains without rain water. The Russian suffix \"ev\" means \"son of.\" Altogether, the name means \"son of things that grow on top of mountains without rainwater.\" It may mean that someone from this ancestral line was known to be very resourceful.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Layliyev",
    "cyrillic": "",
    "checked": "",
    "desc": "Layliyev - last name comes from the Hebrew name \"Laili\" which means nightfall.\" Nightfall refers to someone from this ancestral line to be a party maniac that parties on evenings. The name \"Laili\" can also mean in Uzbek \"purposeless.\" The Russian suffix \"ev\" means \"son of.\" Altogether, the name means \"son of purposeless.\" A person who got this nickname was purposeless or careless.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Levaev",
    "cyrillic": "",
    "checked": "",
    "desc": "Levaev - last name comes from the Hebrew name \"Leva\" which means \"heart.\" The Russian suffix \"ev\" means \"son of.\" Altogether, the name means \"son of heart.\" It may mean that someone from this ancestral line was known to have a good heart to others. The name \"Leva\" also means \"lion.\" The word \"lion\" represents strength, courage or leadership.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Levief",
    "cyrillic": "",
    "checked": "",
    "desc": "Levief - last name comes from a Hebrew name \"Levi\" which means \"joined or attached.\" The Russian suffix \"ef\" means \"son of.\" Altogether, the name means \"son of Levi.\" The name Levi was known to be the third son of Jacob and Leah. He was the ancestor of one of the twelve tribes of the Israelites, known as the Levites. It may mean that the family from this ancestral line was known to always stick together.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Leviev",
    "cyrillic": "Левиев",
    "checked": "",
    "desc": "Leviev - last name comes from a Hebrew name \"Levi\" which means \"joined or attached.\" The Russian suffix \"ev\" means \"son of.\" Altogether, the name means \"son of Levi.\"The name Levi was known to be the third son of Jacob and Leah. He was the ancestor of one of the twelve tribes of the Israelites, known as the Levites. It may mean that the family from this ancestral line was known to always stick together.",
    "links": "https://www.behindthename.com/name/levi",
    "more": ""
  },
  {
    "latin": "Lodaev",
    "cyrillic": "",
    "checked": "",
    "desc": "Lodaev - last name comes from the word ",
    "links": "",
    "more": ""
  },
  {
    "latin": "Lyalyababayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Lyalyababayev - last name comes from the Farsi word \"lyalyababa\" which means \"grandfather.\" The Russian suffix \"ev\" means \"son of.\" Altogether, the name means \"son of grandfather.\" It may mean that somone from this ancestral line was known to wise or look old like a grandfather.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Mahsymov",
    "cyrillic": "",
    "checked": "",
    "desc": "Mahsymov - last name comes from the word \"mahsym\" which means \"authority\" and \"ov\" in Russian means \"son of,\" which means \"son of authority.\" It may mean that someone from this ancestral line was known to be part of the authority.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Maksimov",
    "cyrillic": "",
    "checked": "",
    "desc": "Maksimov - last name comes from the Hebrew name \"Maksum\" which means \"God miracle maker.\" The Russian suffix \"ov\" means \"son of.\" Altogether, the name means \"son of G-ds miracle worker.\" It may mean that someone from this ancestral line was known to be a miracle maker. Maksumov were originally Fuzylov. The word \"Maksum\" also means \"oldest\" in Uzbek. This was contributed by Gavriel Gavrielov.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Maksumov",
    "cyrillic": "",
    "checked": "",
    "desc": "Maksumov - last name comes from the Hebrew name \"Maksum\" which means \"God miracle maker.\" The Russian suffix \"ov\" means \"son of.\" Altogether, the name means \"son of G-ds mircacle maker\". It may mean that someone from this ancestral line was known to be a miracle maker. Maksumov were originally Fuzylov. The word \"Maksum\" also means \"oldest\" in Uzbek. This was contributed by Gavriel Gavrielov.",
    "links": "https://en.wikipedia.org/wiki/Maxim_(given_name)",
    "more": ""
  },
  {
    "latin": "Maksymov",
    "cyrillic": "",
    "checked": "",
    "desc": "Maksymov - last name comes from the Hebrew name \"Maksum\" which means \"God miracle maker.\" The Russian suffix \"ov\" means \"son of.\" Altogether, the name means \"son of G-ds miracle maker.\" It may mean that someone from this ancestral line was known to be a miracle maker. Maksumov were originally Fuzylov. The word \"Maksum\" also means \"oldest\" in Uzbek. This was contributed by Gavriel Gavrielov.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Malakov",
    "cyrillic": "",
    "checked": "",
    "desc": "Malakov - last name comes from the Semitic word \"malak\" which means \"angel\" and \"ov\" in Russian means \"son of,\" which means \"son of angel.\" It may mean that someone from this ancestral line was known to be a miracle worker or beautiful like an angel.",
    "links": "https://en.wikipedia.org/wiki/Malak",
    "more": ""
  },
  {
    "latin": "Malaev",
    "cyrillic": "",
    "checked": "",
    "desc": "Malaev - last name comes from the Farsi word \"mallay\" means \"red hair.\" The word \"mallay\" also means \"servant.\" The Russian suffix \"ev\" means \"son of.\" Altogether, the name means \"son of red haired servant.\" It may mean that someone from this ancestral line was known to have red hair and worked as a servant.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Malayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Malayev - last name comes from the Farsi word \"mallay\" means \"red hair.\" The word \"mallay\" also means \"servant.\" The Russian suffix \"ev\" means \"son of.\" Altogether, the name means \"son of red haired servant\". It may mean that someone from this ancestral line was known to have red hair and worked as a servant.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Mallayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Mallayev - last name comes from the Farsi word \"mallay\" means \"red hair.\" The word \"mallay\" also means \"servant.\" The Russian suffix \"ev\" means \"son of.\" Altogether, the name means \"son of red haired servent.\" It may mean that someone from this ancestral line was known to have red hair and worked as a servant.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Mamanov",
    "cyrillic": "",
    "checked": "",
    "desc": "Mamanov - last name comes from the word ",
    "links": "",
    "more": ""
  },
  {
    "latin": "Mashaev",
    "cyrillic": "",
    "checked": "",
    "desc": "Mashaev - last name comes from the word ",
    "links": "",
    "more": ""
  },
  {
    "latin": "Mashaiv",
    "cyrillic": "",
    "checked": "",
    "desc": "Mashaiv - last name comes from the word ",
    "links": "",
    "more": ""
  },
  {
    "latin": "Masheyev",
    "cyrillic": "",
    "checked": "",
    "desc": "Masheyev - last name comes from the Hebrew name \"Mashe\" which means \"drawn out of the water.\" The Russian suffix \"ev\" means \"son of.\" Altogether, the name means \"son of drawn out of water.\" It may mean that someone or a group of family members from this ancestral line were known to live next to water.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Mashiyev",
    "cyrillic": "",
    "checked": "",
    "desc": "Mashiyev - last name comes from the Hebrew name \"Mashi\" which means \"drawn out of the water.\" The Russian suffix \"ev\" means \"son of.\" Altogether, the name means \"son of drawn out of water.\"  It may mean that someone or a group of family members from this ancestral line were known to live next to water.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Mashkabov",
    "cyrillic": "",
    "checked": "",
    "desc": "Mashkabov - last name comes from the word ",
    "links": "",
    "more": ""
  },
  {
    "latin": "Masikhayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Masikhayev - last name comes from the word ",
    "links": "",
    "more": ""
  },
  {
    "latin": "Mastov",
    "cyrillic": "",
    "checked": "",
    "desc": "Mastov - last name comes from the word \"mast\" which means \"drunk\" and \"ov\" in Russian means \"son of,\" which means \"son of drunk.\" It may mean someone or a group of family member were known to drink a lot on occasions. Mastov is a shorter version of the surname Arakmastov.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Masturov",
    "cyrillic": "",
    "checked": "",
    "desc": "Masturov - last name comes from the word ",
    "links": "",
    "more": ""
  },
  {
    "latin": "Matatov",
    "cyrillic": "",
    "checked": "",
    "desc": "Matatov - last name comes from the Hebrew name \"Matat\" which means \"gift\" and \"ov\" in Russian means \"son of\" which means \"son of gift.\" It may mean that someone from this ancestral line was very generous.",
    "links": "https://www.babynames.com/name/matat",
    "more": ""
  },
  {
    "latin": "Matayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Matayev - last name comes from the word \"matay\" which means ",
    "links": "",
    "more": ""
  },
  {
    "latin": "Mavashev",
    "cyrillic": "",
    "checked": "",
    "desc": "Mavashev - last name comes from the Persian word \"mavash\" which means \"moonlike or beautiful.\" The word \"mavash\" also means dancing or dancers. The Russian suffix \"ev\" means \"son of.\" Altogether, the name means \"son of beuatiful dancers.\" It may mean that someone or a group of family members from this ancestral line were known to be beautiful dancers. The name Mavashev also had ancestors that might have come from Morocco.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Mavlyanov",
    "cyrillic": "",
    "checked": "",
    "desc": "Mavlyanov - last name comes from",
    "links": "",
    "more": ""
  },
  {
    "latin": "Mavlyan",
    "cyrillic": "",
    "checked": "",
    "desc": "Mavlyan - last name comes from",
    "links": "",
    "more": ""
  },
  {
    "latin": "Mayayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Mayayev - last name comes from the Old Persian name \"Maya\" which means \"generous.\" The Russian suffix \"ov\" means \"son of.\" Altogether, the name means \"son of generous.\" It may mean that someone or a group of family members from this ancestral line were known to be generous to others.",
    "links": "https://en.wikipedia.org/wiki/Maya_(given_name)",
    "more": ""
  },
  {
    "latin": "Meirov",
    "cyrillic": "",
    "checked": "",
    "desc": "Meirov - last name comes from the Hebrew name \"Meir\" which means \"one who shines\" and \"ov\" in Russian means \"son of,\" which means \"son of one who shines.\" It may mean that someone from this ancestral line was known to be bright or very clean.",
    "links": "https://en.wikipedia.org/wiki/Meir",
    "more": ""
  },
  {
    "latin": "Michaelov",
    "cyrillic": "",
    "checked": "",
    "desc": "Michaelov - last name comes from the Hebrew name \"Michael\" which means \"gift from God.\" The Russian suffix \"ov\" means \"son of.\" Altogether, the name means \"son of gift from God.\" It may mean that someone from this ancestral line has deep spiritual and religious roots.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Mierov",
    "cyrillic": "",
    "checked": "",
    "desc": "Mierov - last name comes from the Hebrew name \"Meir\" which means \"one who shines\" and \"ov\" in Russian means \"son of,\" which means \"son of one who shines.\" It may mean that someone from this ancestral line was known to be bright or very clean.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Mikhailov",
    "cyrillic": "",
    "checked": "",
    "desc": "Mikhailov - last name comes from the Hebrew name \"Mikhail\" which means \"gift from God.\" The Russian suffix \"ov\" means \"son of.\" Altogether, the name means \"son of gift from God.\" It may mean that someone from this ancestral line has deep spiritual and religious roots.",
    "links": "https://www.sheknows.com/baby-names/name/mikhail/",
    "more": ""
  },
  {
    "latin": "Mikhaylov",
    "cyrillic": "",
    "checked": "",
    "desc": "Mikhaylov - last name comes from the Hebrew name \"Mikhail\" which means \"gift from God.\" The Russian suffix \"ov\" means \"son of.\" Altogether, the name means \"son of gift from God.\" It may mean that someone from this ancestral line has deep spiritual and religious roots.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Mikhoelov",
    "cyrillic": "",
    "checked": "",
    "desc": "Mikhoelov - last name comes from the Hebrew name \"Mikhail\" which means \"gift from God.\" The Russian suffix \"ov\" means \"son of.\" Altogether, the name means \"son of gift from God.\" It may mean that someone from this ancestral line has deep spiritual and religious roots.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Mingov",
    "cyrillic": "",
    "checked": "",
    "desc": "Mingov - last name comes from an Uzbek word \"ming\" which means \"thousand\"?",
    "links": "",
    "more": ""
  },
  {
    "latin": "Mirakov",
    "cyrillic": "",
    "checked": "",
    "desc": "Mirakov - last name comes from the name \"Mirak\" which means ",
    "links": "",
    "more": ""
  },
  {
    "latin": "Mirzakandov",
    "cyrillic": "",
    "checked": "",
    "desc": "Mirzakandov - last name comes from Arabic word \"mirza\" which means \"defense attorney\" and \"kand\" in Farsi means \"sweet.\" The Russian suffix \"ov\" means \"son of.\" Altogether, the name means \"son of sweet defense attorney.\" It may mean that someone from this ancestral line was a charismatic defender.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Mirzayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Mirzayev - last name comes from an Arabic word \"mirza\" has three meaning which are \"defense attorney\" \"writer\" and \"lawyer.\" The Russian suffix \"ev\" means \"son of.\" Altogether, the name means \"son of attorney, writer, and lawyer.\" It may mean that someone from this ancestral line was a defender, writer and lawyer.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Mirzoev",
    "cyrillic": "",
    "checked": "",
    "desc": "Mirzoev - last name comes from an Arabic word \"mirza\" has three meaning which are \"defense attorney\" \"writer\" and \"lawyer.\" The Russian suffix \"ev\" means \"son of.\" Altogether, the name means \"son of attorney, writer, and lawyer.\" It may mean that someone from this ancestral line was a defender, writer and lawyer.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Mirzokandov",
    "cyrillic": "",
    "checked": "",
    "desc": "Mirzokandov - last name comes from Arabic word \"mirza\" which means \"defense attorney\" and \"kand\" in Farsi means \"sweet.\" The Russian suffix \"ov\" means \"son of.\" Altogether, the name means \"son of defense attorney or sweet.\" It may mean that someone from this ancestral line was a charismatic defender.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Mishpatov",
    "cyrillic": "",
    "checked": "",
    "desc": "Mishpatov - last name comes from the Hebrew word \"mishpat\" which means \"judgement\" and \"ov\" in Russian means \"son of,\" which means \"son of judgement.\" It may mean that someone from this ancestral line was known to make decisions or come to sensible conclusions.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Monarov",
    "cyrillic": "",
    "checked": "",
    "desc": "Monarov - last name comes from the word ",
    "links": "",
    "more": ""
  },
  {
    "latin": "Mordechaev",
    "cyrillic": "",
    "checked": "",
    "desc": "Mordechaev - last name comes from the Hebrew name \"Mordechai\" which means \"warrior.\" The Russian suffix \"ev\" means \"son of.\" Altogether, the name means \"son of Warrior.\" It may mean that someone from this ancestral line was known to be strong and brave like a warrior.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Mordechayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Mordechayev - last name comes from the Hebrew name \"Mordechai\" which means \"warrior.\" The Russian suffix \"ev\" means \"son of.\" Altogether, the name means \"son of warrior.\" It may mean that someone from this ancestral line was known to be strong and brave like a warrior.",
    "links": "https://www.sheknows.com/baby-names/name/mordecai/",
    "more": ""
  },
  {
    "latin": "Moshev",
    "cyrillic": "",
    "checked": "",
    "desc": "Moshev - last name comes from the Hebrew name \"Moshe\" which means \"to pull out or draw out.\" The Russian suffix \"ev\" means \"son of.\" Altogether, the name means \"son of Moshe.\" The name \"Moshe\" comes from the name Moses, who pulled the Jews out from Eygpt.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Mosheyev",
    "cyrillic": "",
    "checked": "",
    "desc": "Mosheyev - last name comes from the Hebrew name \"Moshe\" which means \"to pull out or draw out.\" The Russian suffix \"ev\" means \"son of.\" Altogether, the name means \"son of Moshe.\"  The name \"Moshe\" comes from the name Moses, who pulled the Jews out from Eygpt.",
    "links": "https://en.wikipedia.org/wiki/Moses_(given_name)",
    "more": ""
  },
  {
    "latin": "Moshyakhov",
    "cyrillic": "",
    "checked": "",
    "desc": "Moshyakhov - last name comes from the Hebrew name \"Moshiakh\" which means ",
    "links": "",
    "more": ""
  },
  {
    "latin": "Moussaieff",
    "cyrillic": "",
    "checked": "",
    "desc": "Moussaieff - last name comes from the word ",
    "links": "",
    "more": ""
  },
  {
    "latin": "Mulady",
    "cyrillic": "",
    "checked": "",
    "desc": "Mulady - last name comes from the word ",
    "links": "",
    "more": ""
  },
  {
    "latin": "Muladzhanov",
    "cyrillic": "",
    "checked": "",
    "desc": "Muladzhanov - last name comes from the word ",
    "links": "",
    "more": ""
  },
  {
    "latin": "Mulakandov",
    "cyrillic": "",
    "checked": "",
    "desc": "Mulakandov - last name comes from the word \"mullakand\" which means \"rabbi\" and \"kandov\" means \"sweet\" and \"ov\" in Russian means \"son of,\" which means \"son of rabbi and sweet.\" It may mean that a rabbi from this ancestral line was a sweet talker.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Mulayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Mulayev - last name comes from the word \"mulay\" which means ",
    "links": "",
    "more": ""
  },
  {
    "latin": "Mullady",
    "cyrillic": "",
    "checked": "",
    "desc": "Mullady - last name comes from the word ",
    "links": "",
    "more": ""
  },
  {
    "latin": "Mulladzhanov",
    "cyrillic": "",
    "checked": "",
    "desc": "Mulladzhanov - last name comes from the word ",
    "links": "",
    "more": ""
  },
  {
    "latin": "Mullaev",
    "cyrillic": "",
    "checked": "",
    "desc": "Mullaev - last name comes from the word \"mulla\" which means \"teacher.\" The Russian suffix \"ev\" means \"son of.\" Altogether, the name means \"son of teacher.\"  It may mean that someone from this ancestral line was known to be a teacher.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Mullakandarov",
    "cyrillic": "",
    "checked": "",
    "desc": "Mullakandarov - last name comes from the word \"mulla\" which means \"teacher\" and \"kandar\" means ?",
    "links": "",
    "more": ""
  },
  {
    "latin": "Mullakandov",
    "cyrillic": "",
    "checked": "",
    "desc": "Mullakandov - last name comes from the word \"mullakand\" which means \"rabbi\" and \"kandov\" means \"sweet\" and \"ov\" in Russian means \"son of,\" which means \"son of rabbi and sweet.\" It may mean that a rabbi from this ancestral line was a sweet talker.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Mullokandov",
    "cyrillic": "",
    "checked": "",
    "desc": "Mullokandov - last name comes from the word \"mullakand\" which means \"rabbi\" and \"kandov\" means \"sweet\" and \"ov\" in Russian means \"son of,\" which means \"son of rabbi and sweet.\" It may mean that a rabbi from this ancestral line was a sweet talker.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Mullozhanov",
    "cyrillic": "",
    "checked": "",
    "desc": "Mullozhanov - last names from the word \"mullozhan\" which means \"mentor\" and \"ov\" means \"son of,\" which means \"son of mentor.\" It may mean that someone from this ancestral line was known to be a mentor to others. It could also mean that they might have been a teacher.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Mulodzhanov",
    "cyrillic": "",
    "checked": "",
    "desc": "Mulodzhanov - last names from the word \"mullozhan\" which means \"mentor\" and \"ov\" means \"son of,\" which means \"son of mentor.\" It may mean that someone from this ancestral line was known to be a mentor to others. It could also mean that they might have been a teacher.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Munarov",
    "cyrillic": "",
    "checked": "",
    "desc": "Munarov - last name comes from the word \"munar\" which means \"tall statues\" and \"ov\" in Russian means \"son of,\" which means \"son of tall statues.\" It may mean that someone or a group of family members were known to be as tall as statues.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Muradov",
    "cyrillic": "",
    "checked": "",
    "desc": "Muradov - last name comes from the Persian word \"murad\" which means \"desire\" and \"ov\" in Russian means \"son of,\" which means \"son of desire.\" It may mean that someone from this ancestral line was known to have a desire for something.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Murdakhayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Murdakhayev - last name comes from the Hebrew name \"Mordekhai\" which means \"warrior.\" The Russian suffix \"ev\" means \"son of.\" Altogether, the name means \"son of warrior.\" It may mean that someone from this ancestral line was known to be strong and brave like a warrior.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Murdikhayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Murdikhayev - last name comes from the Hebrew name \"Mordekhai\" which means \"warrior.\" The Russian suffix \"ev\" means \"son of.\" Altogether, the name means \"son of warrior.\" It may mean that someone from this ancestral line was known to be strong and brave like a warrior.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Musayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Musayev - last name comes from the word ",
    "links": "",
    "more": ""
  },
  {
    "latin": "Musheyev",
    "cyrillic": "",
    "checked": "",
    "desc": "Musheyev - last name comes from the Hebrew name \"Moshe\" which means \"to pull out or draw out.\" The Russian suffix \"ev\" means \"son of.\" Altogether, the name means \"son of Moshe.\" The name \"Moshe\" comes from the name Moses, who pulled the Jews out from Eygpt.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Mushiev",
    "cyrillic": "",
    "checked": "",
    "desc": "Mushiev - last name comes from the Hebrew name \"Moshe\" which means \"to pull out or draw out.\" The Russian suffix \"ev\" means \"son of.\" Altogether, the name means \"son of Moshe.\" The name \"Moshe\" comes from the name Moses, who pulled the Jews out from Eygpt.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Mushiyev",
    "cyrillic": "",
    "checked": "",
    "desc": "Mushiyev - last name comes from the Hebrew name \"Moshe\" which means \"to pull out or draw out.\" The Russian suffix \"ev\" means \"son of.\" Altogether, the name means \"son of Moshe.\" The name \"Moshe\" comes from the name Moses, who pulled the Jews out from Eygpt.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Namatiyev",
    "cyrillic": "",
    "checked": "",
    "desc": "Namatiyev - last name comes from the Persian word \"namati\" which means \"to bring\"?",
    "links": "",
    "more": ""
  },
  {
    "latin": "Nargorayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Nargorayev - last name comes from the word \"nargora\" which means \"drum.\" The Russian suffix \"ev\" means \"son of.\" Altogether, the name means \"son of drummer.\" It may mean that someone or a group of family members from this ancestral line were known to be a drum players. This was contributed by Gavriel Gavrielov.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Narkalayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Narkalayev - last name comes from the word \"narkala\" which means \"head of house hold.\" The Russian suffix \"ev\" means \"son of.\" It may mean that someone from this ancestral line was known to be the head of their house hold. This was contributed by Gavriel Gavrielov.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Narkolayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Narkolayev - last name comes from the word \"narkola\" which means \"head of house hold.\" The Russian suffix \"ev\" means \"son of.\" It may mean that someone from this ancestral line was known to be the head of their house hold. This was contributed by Gavriel Gavrielov.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Natanelov",
    "cyrillic": "",
    "checked": "",
    "desc": "Natanelov - last name comes from the Hebrew name \"Natanel or Nathanel\" which means \"God has given.\" The Russian suffix \"ov\" means \"son of.\"  It may mean that someone from this ancestral line was known to be a giver to others.",
    "links": "https://en.wikipedia.org/wiki/Nathaniel",
    "more": ""
  },
  {
    "latin": "Natanilov",
    "cyrillic": "",
    "checked": "",
    "desc": "Natanilov - last name comes from the Hebrew name \"Natanel or Nathanel\" which means \"God has given.\" The Russian suffix \"ov\" means \"son of.\" It may mean that someone from this ancestral line was known to be a giver to others.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Natanoff",
    "cyrillic": "",
    "checked": "",
    "desc": "Natanoff - last name comes from the Hebrew name \"Natan\" which means \"he gave.\" The Russian suffix \"off\" means \"son of.\" Altogether, the name means \"son of giver.\"  It may mean that someone from this ancestral line was known to be a giver.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Natanov",
    "cyrillic": "",
    "checked": "",
    "desc": "Natanov - last name comes from the Hebrew name \"Natan\" which means \"he gave.\" The Russian suffix \"ov\" means \"son of.\" Altogether, the name means \"son of giver.\" It may mean that someone from this ancestral line was known to be a giver.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Nazirov",
    "cyrillic": "",
    "checked": "",
    "desc": "Nazirov - last name comes from an Uzbek word \"nazir\" which means \"minister\" and \"ov\" in Russian means \"son of,\" which means \"son of minister.\" It may mean that someone from this ancestral line was known to be a minister.",
    "links": "https://translate.google.com/#view=home&op=translate&sl=uz&tl=en&text=Nazir",
    "more": ""
  },
  {
    "latin": "Nazginov",
    "cyrillic": "",
    "checked": "",
    "desc": "Nazginov - last name comes from an Uzbek word \"nazgin\" which means \"surplus\" and \"ov\" in Russian means \"son of,\" which means \"son of surplus.\" The word \"surplus\" meaning \"financial.\" It may mean that someone from this ancestral line was known to work as a financial advisor. This is primarily used by the Bukharian Jews and Mountain (Kavkazi) Jews.",
    "links": "https://translate.google.com/#view=home&op=translate&sl=uz&tl=en&text=nazgin",
    "more": ""
  },
  {
    "latin": "Nektalov",
    "cyrillic": "",
    "checked": "",
    "desc": "Nektalov - last name comes from the word \"nek\" which means \"good or lucky\" and \"ov\" in Russian means \"son of,\" which means \"son of good.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Nerysev",
    "cyrillic": "",
    "checked": "",
    "desc": "Nerysev - last name comes from the word ",
    "links": "",
    "more": ""
  },
  {
    "latin": "Niazov",
    "cyrillic": "",
    "checked": "",
    "desc": "Niazov - last name comes from the Old Persian word \"Niyaz\" which means \"desire\" and \"ov\" in Russian means \"son of,\" which means \"son of desire.\" It may mean that someone from this ancestral line was known to have a desire for something.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Nisanov",
    "cyrillic": "",
    "checked": "",
    "desc": "Nisanov - last name comes from the Hebrew name \"Nisan\" which means \"miracle\" and \"ov\" in Russian means \"son of,\" which means \"son of miracle.\" It may mean that someone from this ancestral line was known to be a miracle worker.",
    "links": "https://www.thenamemeaning.com/nisan/",
    "more": ""
  },
  {
    "latin": "Nisimov",
    "cyrillic": "",
    "checked": "",
    "desc": "Nisimov - last name comes from the Hebrew name \"Nisim\" which means \"wonders\" and \"ov\" in Russian means \"son of,\" which means \"son of wonders.\" It may mean that someone from this ancestral line was known to be a miracle worker.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Nisonov",
    "cyrillic": "",
    "checked": "",
    "desc": "Nisonov - last name comes from the Hebrew name \"Nisan\" which means \"miracle\" and \"ov\" in Russian means \"son of,\" which means \"son of miracle.\" It may mean that someone from this ancestral line was known to be a miracle worker.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Nissanoff",
    "cyrillic": "",
    "checked": "",
    "desc": "Nissanoff - last name comes from the Hebrew name \"Nisan\" which means \"miracle\" and \"ov\" in Russian means \"son of,\" which means \"son of miracle.\" It may mean that someone from this ancestral line was known to be a miracle worker.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Nissanov",
    "cyrillic": "",
    "checked": "",
    "desc": "Nissanov - last name comes from the Hebrew name \"Nissan\" which means \"miracle\" and \"ov\" in Russian means \"son of,\" which means \"son of miracle.\" It may mean that someone from this ancestral line was known to be a miracle worker.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Nissimov",
    "cyrillic": "",
    "checked": "",
    "desc": "Nissimov - last name comes from the Hebrew name \"Nissim\" which means \"wonders\" and \"ov\" in Russian means \"son of,\" which means \"son of wonders.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Niyazov",
    "cyrillic": "",
    "checked": "",
    "desc": "Niyazov - last name comes from the Old Persian word \"Niyaz\" which means \"desire\" and \"ov\" in Russian means \"son of,\" which means \"son of desire.\" It may mean that someone from this ancestral line was known to have a desire for something.",
    "links": "https://en.wikipedia.org/wiki/Niaz",
    "more": ""
  },
  {
    "latin": "Normatov",
    "cyrillic": "",
    "checked": "",
    "desc": "Normatov - last name comes from the word \"normat\" which means \"birth spot or birthmark\" and \"ov\" in Russian means \"son of,\" which means \"son of birthmark.\" It may mean that someone from this ancestral line was known to have an unique birthmark.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Nosirov",
    "cyrillic": "",
    "checked": "",
    "desc": "Nosirov - last name comes from the word ",
    "links": "",
    "more": ""
  },
  {
    "latin": "Ochildiev",
    "cyrillic": "",
    "checked": "",
    "desc": "Ochildiev - last name comes from the word \"ochildi\" which means \"blossom.\" It may mean that someone from this ancestral line was known to be confident or attractive.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Oksokolov",
    "cyrillic": "",
    "checked": "",
    "desc": "Oksokolov - last name comes from the word \"oksokol\" which means \"white beard or venerable\" and \"ov\" in Russian means \"son of,\" which means \"son of venerable.\" It may mean that a male elder from this ancestral line was known to be well respected by others. It can also mean that they probably worked as a councilman.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Pakanayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Pakanayev - last name comes from the word \"Paka\" which means \"small\" and \"ev\" in Russian means \"son of\" which means \"son of small\". It may mean that someone or a group of family members were from this ancestral line known to be shorter.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Paltielov",
    "cyrillic": "",
    "checked": "",
    "desc": "Paltielov - last name comes from the Hebrew name \"Paltiel\" which means \"deliverance of God.\" It may mean that someone from this ancestral line was known to be a deliverer.",
    "links": "http://www.abarim-publications.com/Meaning/Paltiel.html#.XQpp9JNKj6Y",
    "more": ""
  },
  {
    "latin": "Palvanov",
    "cyrillic": "",
    "checked": "",
    "desc": "Palvanov - last name comes from the word \"palvan\" which means \"a strong man\" and \"ov\" in Russian means \"son of\" which means \"son of a strong man.\" It may mean that a male family member from this ancestral line was known to be strong.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Penchasov",
    "cyrillic": "",
    "checked": "",
    "desc": "Penchasov - last name comes from the Hebrew name \"Pinchas\" which means \"dark-skinned\" and \"ov\" in Russian means \"son of,\" which means \"son of dark-skinned.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Pilosov",
    "cyrillic": "",
    "checked": "",
    "desc": "Pilosov - last name comes from the word \"Pilos\" which means \"philosopher\" and \"ov\" in Russian means \"son of,\" which means \"son of philosopher.\" It may mean that someone from this ancestral line was a philosopher. This name is primarily used by Bukharian Jews.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Pinchasov",
    "cyrillic": "",
    "checked": "",
    "desc": "Pinchasov - last name comes from the Hebrew name \"Pinchas\" which means \"dark-skinned\" and \"ov\" in Russian means \"son of,\" which means \"son of dark-skinned.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Pinchasow",
    "cyrillic": "",
    "checked": "",
    "desc": "Pinchasow - last name comes from the Hebrew name \"Pinchas\" which means \"dark-skinned\" and \"ov\" in Russian means \"son of,\" which means \"son of dark-skinned.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Pinhasov",
    "cyrillic": "",
    "checked": "",
    "desc": "Pinhasov - last name comes from the Hebrew name \"Pinchas\" which means \"dark-skinned\" and \"ov\" in Russian means \"son of,\" which means \"son of dark-skinned.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Pinkhasov",
    "cyrillic": "",
    "checked": "",
    "desc": "Pinkhasov - last name comes from the Hebrew name \"Pinchas\" which means \"dark-skinned\" and \"ov\" in Russian means \"son of,\" which means \"son of dark-skinned.",
    "links": "https://nameberry.com/babyname/Pinchas",
    "more": ""
  },
  {
    "latin": "Plishtiev",
    "cyrillic": "",
    "checked": "",
    "desc": "Plishtiev - last name comes from the Hebrew word \"Plishti\" which means \"of Palestine\" and \"ev\" in Russian means \"son of,\" which means \"son of Palestine. It may mean that someone or a group of family members came from Palestine.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Poltielov",
    "cyrillic": "",
    "checked": "",
    "desc": "Poltielov - last name comes from the Hebrew name \"Poltiel\" which means \"deliverance of God\"  It may mean that someone from this ancestral line was known to be a deliverer.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Polvanov",
    "cyrillic": "",
    "checked": "",
    "desc": "Polvanov - last name comes from the word \"polvan\" which means \"a strong man\" and \"ov\" in Russian means \"son of\" which means \"son of a strong man.\" It may mean that a male family member from this ancestral line was known to be strong.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Poteliakhoff",
    "cyrillic": "",
    "checked": "",
    "desc": "Poteliakhoff - last comes from the word ",
    "links": "",
    "more": ""
  },
  {
    "latin": "Potelyahov",
    "cyrillic": "",
    "checked": "",
    "desc": "Potelyahov - last comes from the word ",
    "links": "",
    "more": ""
  },
  {
    "latin": "Priev",
    "cyrillic": "",
    "checked": "",
    "desc": "Priev - last name comes from the Hebrew word \"pri\" which means \"fruit.\" It may mean that someone from this ancestral line was known to be a sweet person.",
    "links": "https://translate.google.com/#view=home&op=translate&sl=iw&tl=en&text=%D7%A4%D7%A8%D7%99",
    "more": ""
  },
  {
    "latin": "Priyev",
    "cyrillic": "",
    "checked": "",
    "desc": "Priyev - last name comes from the Hebrew word \"pri\" which means \"fruit.\" It may mean that someone from this ancestral line was known to be a sweet person.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Puchaev",
    "cyrillic": "",
    "checked": "",
    "desc": "Puchaev - last name comes from the word ",
    "links": "",
    "more": ""
  },
  {
    "latin": "Puchayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Puchayev - last name comes from the word ",
    "links": "",
    "more": ""
  },
  {
    "latin": "Pulatov",
    "cyrillic": "",
    "checked": "",
    "desc": "Pulatov - last name comes from the word \"pulot\" which means \"steel\" and \"ov\" in Russian means \"son of,\" which means \"son of steel.\"It may mean that someone from this ancestral line was known to be strong like steel or was a steelsmith.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Pulotov",
    "cyrillic": "",
    "checked": "",
    "desc": "Pulotov - last name comes from the word \"pulot\" which means \"steel\" and \"ov\" in Russian means \"son of,\" which means \"son of steel.\"It may mean that someone from this ancestral line was known to be strong like steel or was a steelsmith.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Rafaelov",
    "cyrillic": "",
    "checked": "",
    "desc": "Rafaelov - last name comes from a Hebrew name \"Raphael\" the name \"Raphael\" means \"God has healed\", and \"ov\" in Russian means \"son of\" which means \"son of Raphael\" or \"son of someone whom God has healed.\" This is primarily used by the Bukharian Jews and Mountain (Kavkazi) Jews. Also, \"el\" comes from a Hebrew word that means \"God.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Rafaelow",
    "cyrillic": "",
    "checked": "",
    "desc": "Rafaelow - last name comes from a Hebrew name \"Raphael\" the name \"Raphael\" means \"God has healed.\" This is primarily used by the Bukharian Jews and Mountain (Kavkazi) Jews. Also, \"el\" comes from a Hebrew word that means \"God.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Rafailoff",
    "cyrillic": "",
    "checked": "",
    "desc": "Rafailoff - last name comes from a Hebrew name \"Raphael\" the name \"Raphael\" means \"God has healed.\" This is primarily used by the Bukharian Jews and Mountain (Kavkazi) Jews. Also, \"el\" comes from a Hebrew word that means \"God.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Rafailov",
    "cyrillic": "",
    "checked": "",
    "desc": "Rafailov - last name comes from a Hebrew name \"Raphael\" the name \"Raphael\" means \"God has healed\", and \"ov\" in Russian means \"son of\" which means \"son of Raphael\" or \"son of someone whom God has healed.\" This is primarily used by the Bukharian Jews and Mountain (Kavkazi) Jews. Also, \"el\" comes from a Hebrew word that means \"God.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Rakhmanov",
    "cyrillic": "",
    "checked": "",
    "desc": "Rakhmanov - last name comes from the Hebrew word \"rakhman\" which means \"compassionate\" and \"ov\" in Russian means \"son of,\" which means \"son of compassionate.\" It may mean that someone from this ancestral line was known to be warm-hearted to others.",
    "links": "https://translate.google.com/?um=1&ie=UTF-8&hl=en&client=tw-ob#auto/en/%D7%A8%D7%97%D7%9E%D7%9F",
    "more": ""
  },
  {
    "latin": "Rakhminov",
    "cyrillic": "",
    "checked": "",
    "desc": "Rakhminov - last name comes from the Hebrew word \"rakhmin\" which means \"compassionate\" and \"ov\" in Russian means \"son of,\" which means \"son of compassionate.\" It may mean that someone from this ancestral line was known to be warm-hearted to others.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Rakhnaev",
    "cyrillic": "",
    "checked": "",
    "desc": "Rakhnaev - Rakhnayev - last name comes from the Tajik word \"rakhna\" which means \"breaking through.\" It may mean that someone from this ancestral line was known to be a straight forward person and that they can get through anything.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Rakhnayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Rakhnayev - last name comes from the Tajik word \"rakhna\" which means \"breaking through.\" It may mean that someone from this ancestral line was known to be a straight forward person and that they can get through anything.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Raphaelov",
    "cyrillic": "Рафаэлов, Рафаилов",
    "checked": "",
    "desc": "Raphaelov - last name comes from a Hebrew name \"Raphael\" the name \"Raphael\" means \"God has healed\", and \"ov\" in Russian means \"son of\" which means \"son of Raphael\" or \"son of someone whom God has healed.\" This is primarily used by the Bukharan Jews and Mountain (Kvakazi) Jews. Also, \"el\" comes from a Hebrew word that means \"God.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Ribiev",
    "cyrillic": "",
    "checked": "",
    "desc": "Ribiev - last name comes from the word \"ribi\" which means ",
    "links": "",
    "more": ""
  },
  {
    "latin": "Ribiyev",
    "cyrillic": "",
    "checked": "",
    "desc": "Ribiyev - last name comes from the word \"ribi\" which means ",
    "links": "",
    "more": ""
  },
  {
    "latin": "Rubinoff",
    "cyrillic": "",
    "checked": "",
    "desc": "Rubinoff - last name comes from the Hebrew name \"Rubin\" which means \"behold my son.\" Rubinoff comes from the name Rubin (Reuben) who was the first-born son of Jacob and Leah and the ancestor of the Jewish tribe named after him.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Rubinov",
    "cyrillic": "",
    "checked": "",
    "desc": "Rubinov - last name comes from the Hebrew name \"Rubin\" which means \"behold my son.\" Rubinov comes from the name Rubin (Reuben) who was the first-born son of Jacob and Leah and the ancestor of the Jewish tribe named after him.",
    "links": "https://dbs.bh.org.il/familyname/rubinow",
    "more": ""
  },
  {
    "latin": "Rubinow",
    "cyrillic": "",
    "checked": "",
    "desc": "Rubinow - last name comes from the Hebrew name \"Rubin\" which means \"behold my son.\" Rubinow comes from the name Rubin (Reuben) who was the first-born son of Jacob and Leah and the ancestor of the Jewish tribe named after him.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Rybakov",
    "cyrillic": "",
    "checked": "",
    "desc": "Rybakov - last name comes from the Russian word \"rybak\" which means \"fisherman\" and \"ov\" in Russian means \"son of,\" which means \"son of fisherman.\" It may mean that someone from this ancestral line was a well known fisherman. This name is primarily used by Bukharian Jews.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Sabzanov",
    "cyrillic": "",
    "checked": "",
    "desc": "Sabzanov - last name comes from an Uzbek word \"sabzan\" which means \"carrot\" and \"ov\" in Russian means \"son of,\" which means \"son of carrot\". It may mean that someone from this ancestral line was given the nickname \"sabzan\" based on their appearance by being tall and skinny like a carrot.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Sachakov",
    "cyrillic": "",
    "checked": "",
    "desc": "Sachakov - last name comes from a town of \"Sachak\" near Samarkand and \"ov\" in Russian means \"son of,\" which means \"son of Sachak\". may mean that the family from this ancestral line were known to live in a town of Sachak near Samarkand, Uzbekistan.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Sadykov",
    "cyrillic": "",
    "checked": "",
    "desc": "Sadykov - last name comes from the Hebrew word \"sadyk\" which means \"righteous\" and \"ov\" in Russian means \"son of,\" which means \"son of righteous.\" It may mean that someone from this ancestral line was known to be righteous.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Saidov",
    "cyrillic": "",
    "checked": "",
    "desc": "Saidov - last name comes from an Arabic word \"said\" which means \"happy\" and \"ov\" in Russian means \"son of,\" which means \"son of happy.\" It may mean that someone from this ancestral line was known to be a happy person.",
    "links": "https://en.wikipedia.org/wiki/Sa%E2%80%98id",
    "more": ""
  },
  {
    "latin": "Samandarov",
    "cyrillic": "",
    "checked": "",
    "desc": "Samandarov - last name comes from the city \"Samandar\" that was once the captial of Khazaria and and \"ov\" in Russian means \"son of,\" which means \"son of Samandar\". It may mean that the family from this ancestral line were known to be from Samandar, Khazaria.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Samekhov",
    "cyrillic": "",
    "checked": "",
    "desc": "Samekhov - last name comes from the word ",
    "links": "",
    "more": ""
  },
  {
    "latin": "Sarikov",
    "cyrillic": "",
    "checked": "",
    "desc": "Sarikov - last name comes from an Uzbek word \"sarik\" which means \"yellow\" and \"ov\" in Russian means \"son of,\" which means \"son of yellow.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Sezanaev",
    "cyrillic": "",
    "checked": "",
    "desc": "Sezanaev - last name comes from the words \"se\" which means \"three\" and \"zan\" which means \"wife\" and and \"ev\" in Russian means \"son of,\" which means \"son of three wives\". It may mean that someone from this ancestral line might have had three wifes. This name is primarily used by Bukharian Jews.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Sezanayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Sezanayev - last name comes from the words \"se\" which means \"three\" and \"zan\" which means \"wife\" and and \"ev\" in Russian means \"son of,\" which means \"son of three wives\". It may mean that someone from this ancestral line might have had three wifes. This name is primarily used by Bukharian Jews.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Shabekov",
    "cyrillic": "",
    "checked": "",
    "desc": "Shabekov - last name comes from the words \"sha\" which means \"king\" and \"bek\" which means \"great\". \"Ov\" in Russian means \"son of,\" which means \"son of king\". This was contributed by Gavriel Gavrielov.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Shahomorov",
    "cyrillic": "",
    "checked": "",
    "desc": "Shahomorov - last name comes from the word ",
    "links": "",
    "more": ""
  },
  {
    "latin": "Shakarov",
    "cyrillic": "",
    "checked": "",
    "desc": "Shakarov - last name comes from the word \"shakar\" which means \"sugar\" and \"ov\" in Russian means \"son of,\" which \"son of sugar.\" It may mean that someone from this ancestral line was known to be sweet like sugar or ate a lot sugary sweets. This name is primarily used by Bukarian Jews.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Shakhmoroff",
    "cyrillic": "",
    "checked": "",
    "desc": "Shakhmoroff - last name comes from the word ",
    "links": "",
    "more": ""
  },
  {
    "latin": "Shakhmurov",
    "cyrillic": "",
    "checked": "",
    "desc": "Shakhmurov - last name comes from the word ",
    "links": "",
    "more": ""
  },
  {
    "latin": "Shakmurov",
    "cyrillic": "",
    "checked": "",
    "desc": "Shakmurov - last name comes from the word ",
    "links": "",
    "more": ""
  },
  {
    "latin": "Shalamayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Shalamayev - last name comes from the word ",
    "links": "",
    "more": ""
  },
  {
    "latin": "Shalonov",
    "cyrillic": "",
    "checked": "",
    "desc": "Shalonov - last name comes from the word ",
    "links": "",
    "more": ""
  },
  {
    "latin": "Shamaev",
    "cyrillic": "",
    "checked": "",
    "desc": "Shamaev - last name comes from the word ",
    "links": "",
    "more": ""
  },
  {
    "latin": "Shamailov",
    "cyrillic": "",
    "checked": "",
    "desc": "Shamailov - last name comes from the root word Shema, and/or the rabbi Shammai.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Shamalov",
    "cyrillic": "",
    "checked": "",
    "desc": "Shamalov - last name comes from the word \"shamal\" which means \"wind\" and \"ov\" in Russian means \"son of,\" which means \"son of wind.\" It may mean that someone from this ancestral line was known to be strong as the wind.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Shamayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Shamayev - last name comes from the word ",
    "links": "",
    "more": ""
  },
  {
    "latin": "Shamsiyev",
    "cyrillic": "",
    "checked": "",
    "desc": "Shamsiyev - last name comes from the word ",
    "links": "",
    "more": ""
  },
  {
    "latin": "Sharipov",
    "cyrillic": "",
    "checked": "",
    "desc": "Sharipov - last name comes from the word ",
    "links": "",
    "more": ""
  },
  {
    "latin": "Shaulov",
    "cyrillic": "",
    "checked": "",
    "desc": "Shaulov - last name comes from the Hebrew name \"Shaul\" which means \"asked for or prayed for\" and \"ov\" in Russian means \"son of,\" which means \"son of asked for\". The name \"Shaul\" comes from the first king of Kingdom of Israel.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Shemesh",
    "cyrillic": "",
    "checked": "",
    "desc": "Shemesh - last name comes from the word ",
    "links": "",
    "more": ""
  },
  {
    "latin": "Shimanov",
    "cyrillic": "",
    "checked": "",
    "desc": "Shimanov - last name comes from the Hebrew name \"Shimon\" which means \"listen\" and \"ov\" in Russian means \"son of,\" which means \"son of listen.\" It may mean that someone from this ancestral line was known to be a good listener.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Shimonov",
    "cyrillic": "",
    "checked": "",
    "desc": "Shimonov - last name comes from the Hebrew name \"Shimon\" which means \"listen\" and \"ov\" in Russian means \"son of,\" which means \"son of listen.\" It may mean that someone from this ancestral line was known to be a good listener.",
    "links": "https://www.kveller.com/jewish-baby-name/shimon/",
    "more": ""
  },
  {
    "latin": "Shimunov",
    "cyrillic": "",
    "checked": "",
    "desc": "Shimunov - last name comes from the Hebrew name \"Shimun\" which means \"listen\" and \"ov\" in Russian means \"son of,\" which means \"son of listen.\" It may mean that someone from this ancestral line was known to be a good listener.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Shmuelov",
    "cyrillic": "",
    "checked": "",
    "desc": "Shmuelov - last name comes from the Hebrew name \"Shmuel\" which means ",
    "links": "",
    "more": ""
  },
  {
    "latin": "Sholomov",
    "cyrillic": "",
    "checked": "",
    "desc": "Sholomov - last name comes from the Hebrew word \"shalom\" which means \"peace\" and \"ov\" in Russian means \"son of,\" which means \"son of peace.\" The word \"shalom\" also means \"hello or goodbye.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Shoulov",
    "cyrillic": "",
    "checked": "",
    "desc": "Shoulov - last name comes from the word ",
    "links": "",
    "more": ""
  },
  {
    "latin": "Simkhayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Simkhayev - last name comes from the Hebrew name \"Simkha\" which means \"gladness or joy\" and \"ev\" in Russian means \"son of,\" which means \"son of joy. It may mean that someone from this ancestral line was known to be a joyful person.",
    "links": "https://en.wikipedia.org/wiki/Simcha",
    "more": ""
  },
  {
    "latin": "Sionov",
    "cyrillic": "",
    "checked": "",
    "desc": "Sionov - last name comes from Hebrew name \"Sion\" which means \"gracious\" and \"ov\" in Russian means \"son of,\" which means \"son of gracious.\" It may mean that someone from this ancestral line was known to be polite and kind to others.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Siyunov",
    "cyrillic": "",
    "checked": "",
    "desc": "Siyunov - last name comes from the word ",
    "links": "",
    "more": ""
  },
  {
    "latin": "Sofiev",
    "cyrillic": "",
    "checked": "",
    "desc": "Sofiev - last name comes from an Uzbek word \"sofi\" which means \"wise\" and \"ev\" in Russian means \"son of,\" which means \"son of wise.\"  It may mean that someone from this ancestral line was known to be a wise person.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Solomonov",
    "cyrillic": "",
    "checked": "",
    "desc": "Solomonov - last name comes from the Hebrew name Solomon which means \"peace\" and \"ov\" in Russian means \"son of,\" which means \"son of peace.\" It may mean that someone from this ancestral line was known to be a peacemaker or quiet.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Staraev",
    "cyrillic": "",
    "checked": "",
    "desc": "Staraev - last name comes from the Persian word \"stara\" which means \"the star\" and \"ev\" in Russian means \"son of,\" which means \"son of star.\" It may mean that someone from this ancestral line was known to be as bright as the star.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Sufichayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Sufichayev - last name comes from an Arabic word \"sufi\" which means \"self-disciplined and spiritual\" and \"ev\" in Russian means \"son of,\" which means \"son of self disciplined.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Suleimanov",
    "cyrillic": "",
    "checked": "",
    "desc": "Suleimanov - last name comes from an Arabic version of the Hebrew name Solomon which means \"peace\" and \"ov\" in Russian means \"son of,\" which means \"son of peace.\" It may mean that someone from this ancestral line was known to be a peacemaker or quiet.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Suleymanov",
    "cyrillic": "",
    "checked": "",
    "desc": "Suleymanov - last name comes from an Arabic version of the Hebrew name Solomon which means \"peace\" and \"ov\" in Russian means \"son of,\" which means \"son of peace.\" It may mean that someone from this ancestral line was known to be a peacemaker or quiet.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Suyunov",
    "cyrillic": "",
    "checked": "",
    "desc": "Suyunov - last name comes from an Uzbek word \"suyun\" which means \"water\" and \"ov\" in Russian means \"son of,\" which means \"son of water.\" It may mean that someone from this ancestral line was known to be quick as water.",
    "links": "https://translate.google.com/?um=1&ie=UTF-8&hl=en&client=tw-ob#view=home&op=translate&sl=uz&tl=en&text=suyun",
    "more": ""
  },
  {
    "latin": "Syfiev",
    "cyrillic": "",
    "checked": "",
    "desc": "Syfiev - last name comes from an Uzbek word \"syfi\" which means \"wise\" and \"ev\" in Russian means \"son of,\" which means \"son of wise.\" It may mean that someone from this ancestral line was known to be a wise person.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Tabibov",
    "cyrillic": "",
    "checked": "",
    "desc": "Tabibov - last name comes from an Arabic word \"tabib\" which means \"doctor\" and \"ov\" in Russian means \"son of,\" which means \"son of doctor.\" It may mean that someone from this ancestral line was known to be a doctor or it was a person's lakam - nickname that he acquired since he knew so much about medicine but was not actually a doctor.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Tajikov",
    "cyrillic": "",
    "checked": "",
    "desc": "Tajikov - last name comes from the word \"Tajik\" and \"ov\" in Russian means \"son of,\" which means \"son of Tajik\". It may mean that the family from this ancestral line who were given the nickname \"Tajik,\" came from Tajikistan.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Takhalov",
    "cyrillic": "",
    "checked": "",
    "desc": "Takhalov - this last name has several meanings. The word \"Takhal\" in Hebrew means \"blue\" and \"ov\" in Russian means \"son of,\" which means \"son of blue.\" This nickname was given to people who were painters that would develop blue paint for the dome of mosque. The word \"Takhal\" also means \"bitter.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Tamarov",
    "cyrillic": "",
    "checked": "",
    "desc": "Tamarov - last name comes from the Hebrew name \"Tamar\" which means \"date (the fruit)\" and \"ov\" in Russian means \"son of,\" which means \"son of date.\" It may mean that someone from this ancestral line was known to be sweet as a date or grew date plants.",
    "links": "https://en.wikipedia.org/wiki/Tamar_(name)",
    "more": ""
  },
  {
    "latin": "Tamayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Tamayev - last name comes from an Arabic word \"tama\" which means \"selflessness and greed.\" A family has adopted this name from a lakam - nickname. It could be that someone in your ancestery was David Tama, that later became the lastname Tamayev. The \"ev\" in Russian means \"son of\" basically \"son of Tama\". Altogether the names means son of Tama.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Tanayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Tanayev - last name comes from a Tajik word \"tana\" which means \"Tree trunk, Stem, and Torso\"  A family has adopted this name from a lakam - nickname \"Tana\". It could be that someone in your ancestery was named David Tana, that later became the lastname Tanayev. The \"ev\" in Russian means \"son of\". Altogether the names means son of Tana.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Tolibov",
    "cyrillic": "",
    "checked": "",
    "desc": "Tolibov - last name comes from an Arabic word \"tolib\" which means \"demanding and needed\" and \"ov\" in Russian means \"son of,\" which means \"son of demanding and needed.\" This last name came from the nickname \"tolib.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Tillaev",
    "cyrillic": "",
    "checked": "",
    "desc": "Tillaev - last name comes from the word \"tilla\" which means \"gold\" and \"ev\" in Russian means \"son of''. It may mean that someone or a group of family members from this ancestral line were known to be goldsmiths or were involved with gold work. This name is primarily used by Bukharian Jews.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Tillayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Tillayev - last name comes from the word \"tilla\" which means \"gold\" and \"ev\" in Russian means \"son of''. It may mean that someone or a group of family members from this ancestral line were known to be goldsmiths or were involved with gold work. This name is primarily used by Bukharian Jews.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Tokov",
    "cyrillic": "",
    "checked": "",
    "desc": "Tokov - last name comes from an Uzbek word \"tok\" which means \"vine\" and \"ov\" in Russian means \"son of,\" which means \"son of vine.\" It may mean that the family from this ancestral line were known to have grape vines or were in a wine making business.",
    "links": "https://translate.google.com/?um=1&ie=UTF-8&hl=en&client=tw-ob#uz/en/tok",
    "more": ""
  },
  {
    "latin": "Tolmasov",
    "cyrillic": "",
    "checked": "",
    "desc": "Tolmasov - last name comes from an Uzbek word \"Tolmas\" which means \"strong or muscular\" and \"ov\" in Russian means \"son of,\" which means \"son of strong.\" Tolmasov were originally Babekov. It may mean that someone from this ancestral line was very strong and was well known to be a digger of graves. This was contributed by Gavriel Gavrielov. The word \"Tolmas\" also means \"endurance\".",
    "links": "",
    "more": ""
  },
  {
    "latin": "Tsadykov",
    "cyrillic": "",
    "checked": "",
    "desc": "Tsadyk - last name comes from lakam - nickname the Hebrew word \"tsadyk\" which means \"righteous.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Usharov",
    "cyrillic": "",
    "checked": "",
    "desc": "Usharov - last name comes from the word \"Ushar,\" which means \"awake or alert.\" The Russian suffix \"ov\" means \"son of.\" Altogether, the name means \"son of alert.\" It may mean that someone from this ancestral line was a fast thinker or very alert. This name is primarily used by Bukharian Jews.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Ushyarov",
    "cyrillic": "",
    "checked": "",
    "desc": "Ushyarov - last name comes from the word \"Ushar,\" which means \"awake or alert.\" The Russian suffix \"ov\" means \"son of.\" Altogether, the name means \"son of alert.\" It may mean that someone from this ancestral line was a fast thinker or very alert. This name is primarily used by Bukharian Jews.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Ustaev",
    "cyrillic": "",
    "checked": "",
    "desc": "Ustaev - last name comes from the Lakam nickname \"Usto.\" In Uzbek, the word \"ustoy\" means \"master, teacher, or mentor.\" It may mean that someone from this ancestral line was known for their wisdom and mastery of their trade. In the Bukharian Jewish community, being a master meant that you studied and mastered a trade. This name is primarily used by Bukharian Jews.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Ustoniyazov",
    "cyrillic": "",
    "checked": "",
    "desc": "Ustoniyazov - last name comes from the Lakam nickname \"Usto.\" In Uzbek, the word \"ustoy\" means \"master, teacher, and mentor.\" \"Niyaz\" comes from a name that in Persian means \"need, necessity, and plea.\" Altogether, the name means \"master of plea.\" The Russian suffix \"ov\" means \"son of.\" Altogether, the name means \"son of the master of plea.\" This type of nickname was given to people as a form of respect for being righteous and wise.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Ustoyev",
    "cyrillic": "",
    "checked": "",
    "desc": "Ustoyev - last name comes from the Lakam nickname \"Usto.\" In Uzbek, the word \"ustoy\" means \"master, teacher, and mentor.\" It may mean that someone from this ancestral line was known for their wisdom and mastery of their trade. In the Bukharian Jewish community, being a master meant that you studied and mastered a trade. The Russian suffix \"ev\" means \"son of.'' This name is primarily used by Bukharian Jews.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Uvaydov",
    "cyrillic": "",
    "checked": "",
    "desc": "Uvaydov - last name comes from an Arabic word and nickname, \"uvayd,\" which means \"slave.\" The Russian suffix \"ov\" means \"son of.\" Altogether, the name means \"son of slave.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Vadyaev",
    "cyrillic": "",
    "checked": "",
    "desc": "Vadyaev - last name comes from the name Ovadiya. The Hebrew word \"vadya\" means \"prophet.\" It can also be translated as \"servant of God.\" The Russian suffix \"ev\" means \"son of.\" It means that children of Ovadiya later got his name as a last name, and so the names Vadyaev and Ovadiyaev mean \"son of Vadya.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Valiev",
    "cyrillic": "",
    "checked": "",
    "desc": "Valiev - last name comes from an Uzbek word \"vali,\" which means \"governor.\" It can also be translated as \"holy.\" It may mean that someone from this ancestral line was a community leader. Usually, a family would get this last name from Lakam, making it an ancestral nickname. The Russian suffix \"ev\" means \"son of.\" It means that children of Vali later got the last name from his nickname.",
    "links": "https://translate.google.com/#view=home&op=translate&sl=uz&tl=en&text=Vali",
    "more": ""
  },
  {
    "latin": "Yacobov",
    "cyrillic": "",
    "checked": "",
    "desc": "Yacobov -last name comes from the Hebrew name Yakub, which means “to follow or supplanter.\" Yakubov comes from the name Yakub (Jacob), who was the third patriarch and the younger twin son of Isaac and RebekahIt. The Russian suffix \"ov\" means \"son of.\" Altogether, the name means \"son of Yakub - Yakubov.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Yadgaroff",
    "cyrillic": "",
    "checked": "",
    "desc": "Yadgaroff - last name comes from the word \"yadgar,\" which means \"memory.\" The Russian suffix \"ov\" means \"son of.\" Altogether, the name means \"son of memory.\" According to Hana Tolmas, if a mother died during childbirth, her son would be given the name Yadgor, wich means \"memory or remebering.\"  If she gave birth to a girl, then she would be named Aziza, which in Arabic translates to \"dear beloved.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Yadgarov",
    "cyrillic": "",
    "checked": "",
    "desc": "Yadgarov -  last name comes from the word \"yadgar,\" which means \"memory.\" The Russian suffix \"ov\" means \"son of.\" Altogether, the name means \"son of memory.\" According to Hana Tolmas, if a mother died during childbirth, her son would be given the name Yadgor, wich means \"memory or remebering.\"  If she gave birth to a girl, then she would be named Aziza, which in Arabic translates to \"dear beloved.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Yagoudaief",
    "cyrillic": "",
    "checked": "",
    "desc": "Yagoudaief - last name comes from the Russian word \"yaguda,\" which means \"berry.\" The word \"yaguda\" is also a Russian version of the Hebrew name Yehuda, or Judah, which means \"praise.\" Yehuda (Judah) was the fourth son of the twelve sons of Jacob and Leah and the ancestor of the tribe of Judah.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Yagudayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Yagudayev - last name comes from the Russian word \"yaguda,\" which means \"berry.\" The word \"yaguda\" is also a Russian version of the Hebrew name Yehuda, also known as Judah, which means \"praise.\" The Russian suffix \"ov\" means \"son of.\" Altogether, the name means \"son of Yehuda.\"  Yehuda (Judah) was the fourth son of the twelve sons of Jacob and Leah and the ancestor of the tribe of Judah.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Yakubov",
    "cyrillic": "",
    "checked": "",
    "desc": "Yakubov - last name comes from the Hebrew name \"Yakub,\" which means “to follow or supplanter.\" Yakubov comes from the name Yakub (Jacob), who was the third patriarch and the younger twin son of Isaac and RebekahIt. The Russian suffix \"ov\" means \"son of.\" Altogether, the name means \"son of Yakub - Yakubov.",
    "links": "https://dbs.bh.org.il/familyname/yakubovici",
    "more": ""
  },
  {
    "latin": "Yakutielov",
    "cyrillic": "",
    "checked": "",
    "desc": "Yakutielov - Yekutielov - last name comes from the Hebrew name Yekutiel, who was from the Yehuda tribe. In Hebrew, Yekutil means \"hope.\" The Russian suffix \"ov\" means \"son of.\" Altogether, the name means \"son of hope.\" Variations of this last name include Yekutilov and Yakutilov.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Yasayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Yasayev - last name comes from the name \"Yashai,\" pronounced by Muslims as \"Yisa.\" This was the name of the father of the King David. Yasayev was originally a first name that later became a last name. The Russian suffix \"ev\" means \"son of.\" Altogether, the name means \"son of Yashay.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Yashayaev",
    "cyrillic": "",
    "checked": "",
    "desc": "Yashayaev - last name comes from the name \"Yashai,\" the name of the father of King David. Yashayaev was originally a first name that later became a last name. The Russian suffix \"ev\" means \"son of.\"  Altogether, the name means \"son of Yashai.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Yekutielov",
    "cyrillic": "",
    "checked": "",
    "desc": "Yekutielov - last name comes from the Hebrew name Yekutiel, who was from the Yehuda tribe. In Hebrew, Yekutil means \"hope.\" The Russian suffix \"ov\" means \"son of.\" Altogether, the name means \"son of hope.\" Yekutielov, or Yakutielov, was originally a first name that later became a last name.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Yelizarov",
    "cyrillic": "",
    "checked": "",
    "desc": "Yelizarov - last name comes from the Hebrew name Eliezer, which means \"help of my G-d.\" Eliezer was the second son of Moses and Zipporah. The Russian suffix \"ov\" means \"son of.\" Altogether, the name means \"son of Eliezer.\" Originally it was the first name Eliezer, and later became the last name Yelizarov.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Yohananov",
    "cyrillic": "",
    "checked": "",
    "desc": "Yohananov -  last name comes from the Hebrew name Yuhanan, which means \"gracious.\" The Russian suffix \"ov\" means \"son of.\" Alltogether, the name means \"son of (gracious) Yukhanan.\" Yukhanan was one of the Generals of Jeremiah. Originally, it was the first name Yukhanan, and later became the last name Yukhananov.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Yokubov",
    "cyrillic": "",
    "checked": "",
    "desc": "Yokubov - last name comes from the Hebrew name \"Yakub,\" which means “to follow or supplanter.\" Yakubov comes from the name Yakub (Jacob), who was the third patriarch and the younger twin son of Isaac and RebekahIt. The Russian suffix \"ov\" means \"son of.\" Altogether, the name means \"son of (Yakov).\" Originally it was a first name that later became a last name.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Yosopov",
    "cyrillic": "",
    "checked": "",
    "desc": "Yosopov - last name comes from the Hebrew name Yosef, which means \"add or increase.\" The suffix \"ov\" in Russian means \"son of.\" Altogether, the name means \"son of Yosef\". Yosef was the son of Yakov and Rachel and was second in command in Egypt. The last name comes from the name Yosef, later changed to Yusuf, and became Yusupov or Yusupoff.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Yudakov",
    "cyrillic": "",
    "checked": "",
    "desc": "Yudakov - last name comes from the Hebrew name Yehuda. Yehuda was son of Yakov, and the Russian suffix \"ov\" means \"son of.\" Altogether, the name means \"son of (Yehuda).\" Originally it was a first name that later became a last name.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Yuhananov",
    "cyrillic": "",
    "checked": "",
    "desc": "Yuhananov - last name comes from the Hebrew name Yuhanan, which means \"gracious.\" The suffix \"ov\" in Russian means \"son of.\" Altogether, the name means \"son of (gracious) Yukhanan.\" Yukhanan was one of the Generals of Jeremiah. Yukhanan was originally a first name, but later became the last name Yukhananov.",
    "links": "https://en.wikipedia.org/wiki/Yohanan",
    "more": ""
  },
  {
    "latin": "Yukhananov",
    "cyrillic": "",
    "checked": "",
    "desc": "Yukhananov - last name comes from the Hebrew name Yuhanan, which means \"gracious.\" The Russian suffix \"ov\" means \"son of.\" Altogether, the name means \"son of (gracious) Yukhanan.\" Yukhanan was one of the Generals of Jeremiah. Originally it was a first name that later became a last name.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Yunaev",
    "cyrillic": "",
    "checked": "",
    "desc": "Yunaev - last name comes from the Hebrew name Yuno which means \"dove\" and/or \"prophet.\" The Russian suffix \"ev\" means \"son of.\" Altogether, the name means \"son of Yuno.\" Yuno was a very popular name in the  Bukharian community that later became a last name. Variations of this last name include the last names Yanayev and Yunusov.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Yunatanov",
    "cyrillic": "",
    "checked": "",
    "desc": "Yunatanov - last name comes from the Hebrew name Yunatan, which means \"given or given by G-d.\" The Russian suffix \"ov\" means \"son of.\" Altogether, the name means \"son of Yunatan.\" Yonatan was the name of King Shaula's son. Originally it was a first name that later became a last name.",
    "links": "https://theisraelbible.com/glossary/yonatan/",
    "more": ""
  },
  {
    "latin": "Yunayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Yunayev - last name comes from the Hebrew name Yuno, which means \"dove\" and/or \"prophet.\" The Russian suffix \"ev\" means \"son of.\" Altogether, the name means \"son of Yuno.\" Yuno was a very popular first name in the Bukharian community that later became a last name. Variations of this last name includes the last names Yunaev and Yunusov.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Yunusov",
    "cyrillic": "",
    "checked": "",
    "desc": "Yunusov - last name comes from the Hebrew name Yuno, which means \"dove\" and/or \"prophet.\" The Russian suffix \"ov\" means \"son of.\" Altogether, the name means \"son of Yuno.\" Yuno was a very popular first name in the Bukharian community that later became a last name. Variations of this last name include last names Yunaev and Yunayev.",
    "links": "https://en.wikipedia.org/wiki/Yunus",
    "more": ""
  },
  {
    "latin": "Yushuvayev",
    "cyrillic": "",
    "checked": "",
    "desc": "Yushuvayev - last name comes from the Hebrew name Yohashua, which belonged to the son of Nun and successor of Moshe Avinu. The Russian suffix \"ev\" means \"son of.\" Altogether, the name means  \"son of Yohashua.\" Originally it was a first name that later became a last name.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Yusupoff",
    "cyrillic": "",
    "checked": "",
    "desc": "Yusupoff - last name comes from the Hebrew name Yosef, which means \"add or increase.\" The Russian suffix \"off\" means \"son of.\" Altogether, the name means \"son of Yosef\"  Yosef was the son of Yakov and Rachel, who was second in command in Egypt. The last name comes from the first name Yosef, which was changed to Yusuf. One variation of this last name includes the last name Yusupoff.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Yusupov",
    "cyrillic": "",
    "checked": "",
    "desc": "Yusupov - last name comes from the Hebrew name Yosef, which means \"add or increase.\" The Russian suffix \"ov\" means \"son of.\" Altogether, the name means \"son of Yosef.\" Yosef was the son of Yakov and Rachel, who was second in command in Egypt. The last name comes from the first name Yosef, which was changed to Yusuf. One variation of this last name includes the last name Yusupoff.",
    "links": "https://en.wikipedia.org/wiki/Yosef",
    "more": ""
  },
  {
    "latin": "Zakinov",
    "cyrillic": "",
    "checked": "",
    "desc": "Zakinov - last name comes from the Hebrew word \"zakin,\" which means \"an elder.\" The Russian suffix \"ov\" means \"son of.\" Altogether, the name means \"son of an elder.\" It may mean that an elder from this ancestral line was known to be well-respected or wise.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Zargarov",
    "cyrillic": "",
    "checked": "",
    "desc": "Zargarov - last name comes from the word \"zargar,\" which means \"jeweler.\" The Russian suffix \"ov\" means \"son of.\" Altogether, the name means \"son of jeweler.\" It may mean that someone from this ancestral line was a well- known jeweler. \"Zargar\" was originally a nickname that later became the last name Zargarov.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Zaurov",
    "cyrillic": "",
    "checked": "",
    "desc": "Zaurov - last name comes from the Arabic word \"zayr,\" which means \"person making pilgrimage to holy places.\" The Russian suffix \"ov\" means \"son of.\" Altogether, the name means \"son of person making pilgrimage to holy places.\" Originally, it was a first name that later beame a last name. Some say that it comes from two different meanings of the word \"zaur,\" which means \"spring\" in Farsi and \"rice\" in Uzbek.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Zavlanov",
    "cyrillic": "",
    "checked": "",
    "desc": "Zavlanov - last name comes from the name Zavulun, which belonged to the son of Yakov and Leah. The word \"zavulun\" also means \"joy\" in Uzbek. The Russian suffix \"ov\" means \"son of.\" Altogether, the name means \"son of Zavulun.\" This last name was originally Zavulunov and later become Zavlanov.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Zavlyanov",
    "cyrillic": "",
    "checked": "",
    "desc": "Zavlyanov - last name comes from the name Zavulun, which belonged to the son of Yakov and Leah. The word \"zavulun\" also means \"joy\" in Uzbek. The Russian suffix \"ov\" means \"son of.\" Altogether, the name means \"son of Zavulun\". This last name was originally Zavulunov and later became Zavlanov.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Zavulunov",
    "cyrillic": "",
    "checked": "",
    "desc": "Zavulunov - last name comes from the name Zavulun, which belonged to the son of Yakov and Leah. The word \"zavulun\" also means \"joy\" in Uzbek. The Russian suffix \"ov\" means \"son of.\" Altogether, the name means \"son of Zavulun.",
    "links": "",
    "more": ""
  },
  {
    "latin": "Zavurov",
    "cyrillic": "",
    "checked": "",
    "desc": "Zavurov - last name comes from the Arabic word \"zayr,\" which means \"person making pilgrimage to holy places.\" The Russian suffix \"ov\" means \"son of.\" Altogether, the name means \"son of person making pilgrimage to holy places.\" It was originally a first name that later become a last name.",
    "links": "https://translate.google.com/#view=home&op=translate&sl=uz&tl=en&text=Zavur",
    "more": ""
  },
  {
    "latin": "Zayrov",
    "cyrillic": "",
    "checked": "",
    "desc": "Zayrov - the last name comes from the Arabic word \"zayr,\" which means \"person making pilgrimage to holy places''. The Russian suffix \"ov\" means \"son of,\" so altogether the name means \"son of person making pilgrimage to holy places.\" It was originally a first name that later become a last name.",
    "links": "https://translate.google.com/?biw=1280&bih=720&um=1&ie=UTF-8&hl=en&client=tw-ob#view=home&op=translate&sl=kk&tl=en&text=zayr",
    "more": ""
  },
  {
    "latin": "Zirkiev",
    "cyrillic": "",
    "checked": "",
    "desc": "Zirkiev - the last name comes from the word \"zirki,\" which in Tadjik means \"resourceful , intelligent, and quick-witted.\" This name was originally the nickname of a person whose name became a family name during the census of Russian Empire. The Russian suffix \"ev\" means \"son of.\" Altogether, the name means \"son of quick- witted individual.",
    "links": "",
    "more": ""
  }
]